export const posts = [
  {
    id: 5,
    meta: {
      duration: "شو قصة استثماري بـCSGO",
      year: "3/9/2025",
      summary: "كيف رجعت أضعاف فلوسي"
    },
    events: [
      {
        t: "h1",
        c: "البداية"
      },
      {
        t: "p",
        c: "كنت بقلب عالنت عادي، اجت عيني على منشور لشخص اشتري وقتها أشياء من متجر لعبة CSGO وهاد الأشياء سعرها صار أضعاف مضاعفة"
      },
      {
        t: "p",
        c: "وقتها اجاني الفضول افهم شو صار، كانت السنة 2020 ووقتها دخلت بعالم الستيكرات، الستيكرات أو الملصقات هي قطع جوا اللعبة يعني اشي مش ملموس لكن قيمتهم عالية"
      },
      {
        t: "p",
        c: "شو نعمل يعني الناس بتحب يكون عندها ملصقات حلوة على الأسلحة جوا اللعبة"
      },
      {
        t: "p",
        c: "اخدت الموضوع بشكل جدي لما لقيت ستيكر سعره صار فوق الـ60 ألف دولار! انه كيف هيك صار يعني؟؟ ودخلت على مجتمع المستثمرين وقتها من أوسع أبوابه"
      },
      {
        t: "p",
        c: "بس بـ2020 كانت في مشكلة، مافي معي فيزا كارد أشتري فيها! فقررت ببحث عن الموضوع ولقيت انه بطاقة بنك فلسطين الكاش كارد بتزبط للمشتريات اونلاين"
      },
      {
        t: "p",
        c: "حطيت فيها وقتها 200 دولار اشتري فيهم ملصقات جوا اللعبة"
      },
      {
        t: "p",
        c: "استنيت خصم الـ75% اللي بييجي عالملصقات ووقتها شريت كمية منيحة"
      },
      {
        t: "p",
        c: "طبعا سويت أخطاء وقتها انه في اشياء كنت ببيعها وبشتري حجات تانية هيك بدون تخطيط منيح، فمش كل اشي اشتريته لسا ضايل"
      },
      {
        t: "p",
        c: "من أكبر الأخطاء اللي عملتهم اني استعجلت بالبيع، في عندي ستيكر شريته بدولار بس ولما سعره صار 13 دولار بعته، صبرت عليه سنة طبعا لحد ماصار 13 دولار"
      },
      {
        t: "p",
        c: "وقتها كان معي 4 ستيكرات منهم وبعت 3، خليت واحد للمدى البعيد، شو اللي كان مفروض اعمله؟ كان مفروض اني اخليهم كلهم للمدى البعيد، خلص انساهم هيك واحطهم على شقة"
      },
      {
        t: "p",
        c: "وهاد اللي صار معي بسبب الحرب، يوم 6 اكتوبر الساعة 6 المسا كانت اخر مرة الي مع الستيكرات، الحرب اجت وقطعني النت من أول ساعة فيها"
      },
      {
        t: "p",
        c: "هلقيت جيت وتابعت الأسعار لقيت انه في ستيكر سعره كان نص شيكل بس، هلقيت سعره صار 400 شيكل! كيف ليش بعرفش"
      },
      {
        t: "p",
        c: "هلقيت صار عمرهم 4 سنوات الملصقات عندي، لسا طبعا مش هبيع كل اشي، انا المدى اللي اياه عالأقل 7 سنوات"
      },
      {
        t: "h2",
        c: "الخلاصة"
      },
      {
        t: "p",
        c: "حطيت فلوس ب200 دولار، رجعولي ألف وأكتر، هستثمر تاني؟ أكيد."
      }
    ]
  },
  {
    id: 4,
    meta: {
      duration: "كيف تعاملت مع المجاعة",
      year: "19/8/2025",
      summary: "كيف كانت أصعب أيام الحرب"
    },
    events: [
      {
        t: "h1",
        c: "المجاعة"
      },
      {
        t: "p",
        c: "طبعا مشروع التجويع تاع اليهود بدأ من بعد العيد، كنا لسا بخير وعندنا مخزون أكل كافي من معلبات وأكياس طحين"
      },
      {
        t: "p",
        c: "ماكان في اشي بيفوت البلد نهائي، ف المخزون بدأ يقل شوي شوي لحد م انتهى الطحين من البيت"
      },
      {
        t: "p",
        c: "ووراه انتهت المعلبات، اشترينا الطحين أيامها على 100 شيكل واكتر"
      },
      {
        t: "p",
        c: "كنا نعمل طحين مع معكرونة، لحد م انقطعت المعكرونة من البلد"
      },
      {
        t: "p",
        c: "صرنا نعمل نظام توزيع على افراد العيلة، كان كل شخص ياخد 6 أو 7 أرغف من الخبر يوميا أو كل يومين مرة"
      },
      {
        t: "p",
        c: "كنا ناكل عدس كل كم يوم، وكنا مرات نجيب أكل من التيكيات"
      },
      {
        t: "p",
        c: "كانت أيام صعبة، الأكل كان مرة باليوم، كنا صايمين حرفيا، مع كل اللي بيصير كان خسيت تقريبا 8 كيلو بأسبوعين"
      },
      {
        t: "p",
        c: "وصلت لحد 50 كيلو وزن، وقتها انفزعت، كنت بادي بالنحافة، ومعاها راحت العضلات، الأكل كان كل يوم بس ما فيه أي قيمة غذائية"
      },
      {
        t: "p",
        c: "وأجت فترة ماكان في خبز نهائي، كان الأكل رز أو عدس يكون كل يوم"
      },
      {
        t: "p",
        c: "مرت هالأيام وعدت والحمدلله الآن راحت المجاعة من عندنا، وهيني هلقيت قاعد أتعافى من ضرر الجوع على الجسم"
      },
      {
        t: "p",
        c: "الله لايعيدها من أيام"
      }
    ]
  },
  {
    id: 3,
    meta: {
      duration: "كل شيء تعلمته عن الزراعة",
      year: "18/8/2025",
      summary: "بشارك معلوماتي البسيطة لكل شيء تعلمته حتى الآن",
    },
    events: [
      {
        t: "h1",
        c: "كل شيء تعلمته عن الزراعة",
      },
      {
        t: "p",
        c: "أول اشي انا عندي معرفة بسيطة جدا كانت عن الزراعة من قبل، وعندي برضو خبرة كمان بس قليلة",
      },
      {
        t: "p",
        c: "الخبرة عندي كانت زراعة فول وذرة قبل 10 لـ15 سنة زمان",
      },
      {
        t: "p",
        c: "وبرضو كان عنا أرض مرة بس مابقيت مركز بالزراعة ولابعرف اشي عنها غير اني اسقي الزرع",
      },
      {
        t: "p",
        c: "انا هلقيت بتكلم عن كل شيء تعلمته عن الزراعة آخر فترة هاد، لما قررت اني أبدأ أزرع، والأشياء اللي تعملتها من النت بالوقت هاد",
      },
      {
        t: "p",
        c: "تعلمت أوقات السقي، أوقات رش السماد، أنواع الحشرات، كيف أصنع الكومبوست، كيف أعمل سماد طبيعي بالبيت",
      },
      {
        t: "p",
        c: "وطبعا سويت أخطاء كبيرةةة، منها اني زرعت البذور جنب بعض وبكمية كبيرة، هاد غلطة مش بسيطة",
      },
      {
        t: "p",
        c: "طيب شو تعلمت من هاد الغلطة؟ انه بدي اعمل أداة عشان اعمل مسافات منيحة بين البذور، طبعا مش كل النباتات بيصير مشكلة لما تزرعهم هيك",
      },
      {
        t: "p",
        c: "أقصد هيك انه يعني ملزقات ببعض، يعني الجرجير مش مشكلة، والبقدونس كمان",
      },
      {
        t: "p",
        c: "بالحالة اللي انا فيها، مفترض عملت هيك لنبتة السِلِق عندي، عالأقل 5 سم بين كل نبتة",
      },
      {
        t: "p",
        c: "كمان تعلمت من النت طبعا، لسا بدي أطبق عملي عندي وأجرب عشان اقول انه بعرف صرت",
      },
      {
        t: "p",
        c: "زراعة البندورة والخيار والأشجار زي العنب والمانجا وكمان تعلمت كيف البطاطا والثوم والبصل بينزرعو ومتى وكيف اهتم فيهم",
      },
      {
        t: "p",
        c: "وكمان شفت كيف اصنع مزرعة مائية، اللي مافيها رمل خالص وبتبقى معمولة من بلاستيك وبرابيش وماتور مضخة مية",
      },
      {
        t: "p",
        c: "طيب هلقيت خلصت تعلمت كل اشي من المزرعة الزغنونة اللي قاعد اجرب فيها؟ لا طبعا",
      },
      {
        t: "p",
        c: "هلقيت انا لسا بدي أدرس منيح التربة الزراعية الممتازة واللي بيطلع منها نباتات قوية",
      },
      {
        t: "p",
        c: "جربت نوعين من التربة، جبت طينة وجبت تربة ارض عادية",
      },
      {
        t: "p",
        c: "انا للآن اشوف انه الطينة أحسن بكثير، وبتحافظ على المية والرطوبة أكثر، حتى اللي زرعتو فيها بدأ يطلع من تاني يوم",
      },
      {
        t: "p",
        c: "وفي كمان عندي خطر في بالي فكرة التشتيل، أعمل مشتل، عشان هيك طلعت مرة وجبت حوالي 100 علبة فاضيين عشان اعمل فيهم هيك اشي",
      },
      {
        t: "h3",
        c: "بس المشكلة الأكبر",
      },
      {
        t: "p",
        c: "الموارد محدودة جدااا، المية الحلوة يدوب تكفينا، أنا طبعا مابسقي الا مية حلوة، وكمان المساحة غير متوفرة مافي عندي أرض أزرعها",
      },
      {
        t: "p",
        c: "بس هيك فكرة هعملها لما المية تتوفر بشكل أكبر شوي",
      },
      {
        t: "p",
        c: "وان شاء الله ربنا بيوفقني وبيعطيني علم الزراعة وبيخليني افهمه واصير شاطر فيه، الزراعة حياة، احبها بكل اوقاتها وصعوباتها من وانا صغير وبلعب المزرعة السعيدة",
      },
    ],
  },
  {
    id: 2,
    meta: {
      duration: "أرشيف زينة علاء",
      year: "12/3/2025",
      summary: "صور لزوزو وهي تكبر شوي شوي",
    },
    events: [
      {
        t: "p",
        c: "الأسبوع الأول",
      },
      {
        t: "img",
        c: "https://i.imgur.com/veWwRQj.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/d6rTRn1.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/8BfRcqh.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ijvHEm7.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ZfvQaOg.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/2ojzhZx.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/xSdxBU5.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/FSOd4Dr.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/d7dJrWF.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/sTxwgDE.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/uM960wo.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/SqEwI7g.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/fvDeh2m.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/dz0tpya.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/gvpGEOn.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/FE2532S.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/YIk34Vr.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/OKiCqxA.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Uzhok2k.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ng07zCh.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/GDLQbb8.jpeg",
      },
      {
        t: "p",
        c: "خمس شهور",
      },
      {
        t: "img",
        c: "https://i.imgur.com/1xICV0J.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/r6kE7Vq.jpeg"
      }
    ],
  },
  {
    id: 1,
    meta: {
      duration: "روتين الفترة الحالية",
      year: "12/8/2025",
      summary: "روتين فترة مابعد المجاعة",
    },
    events: [
      {
        t: "h1",
        c: "صباح اليوم",
      },
      {
        t: "p",
        c: "بصحى الساعة 6 يوميا، بصلي الفجر، بقرأ أذكاري، بعدها بسقي نباتاتي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/eLBqJAt.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بعدها بسوي فطوري الخفيف اللطيف",
      },
      {
        t: "p",
        c: "بحشي 3 تمرات على رغيف خبز، وبعمل بعدها كاسة شاي مع سكر طبعااا ✨",
      },
      {
        t: "img",
        c: "https://i.imgur.com/gFXwrqx.jpeg",
      },
      {
        t: "p",
        c: "الخبز عليه شوية رماد من النار لأنه بنخبز مرات على صاج وبيبقى في دخان من النار أسود",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "لما أصحصح - الساعة 11 الصبح",
      },
      {
        t: "p",
        c: "بفتح اللابتوب وبقعد أبرمج ساعة ساعتين متواصل",
      },
      {
        t: "p",
        c: "لازم كل يوم برمجة عندي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/NMBnU4o.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بضيف الأحداث عالموقع",
      },
      {
        t: "p",
        c: "من الأشياء اللي بسويها صرت كل يوم هي إضافة الأحداث هان أول بأول",
      },
      {
        t: "img",
        c: "https://i.imgur.com/3Ny3VJG.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "اللعب من زوزوووو",
      },
      {
        t: "p",
        c: "بتيجينا من الصبح وببقى أقعد معها ألعب وأسليها وأتخرف معها",
      },
      {
        t: "p",
        c: "أحبهااااا",
      },
      {
        t: "img",
        c: "https://i.imgur.com/KKLs8zB.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "طلعة السوق",
      },
      {
        t: "p",
        c: "صارت طلعة السوق اشي شبه يومي هيك من الساعة 9 الصبح بشوف كيف الأسعار بعد ما الدنيا فتحت",
      },
      {
        t: "p",
        c: "مرات بشتري ومرات بس بروح أعرف آخر الأسعار",
      },
      {
        t: "img",
        c: "https://i.imgur.com/P02gj0S.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "منفسي من هالواقع",
      },
      {
        t: "p",
        c: "بس أخلص الدراسة تعت كل يوم، مرات ببقى زهقان وبفتح ألعب",
      },
      {
        t: "p",
        c: "وفي مرات بقرأ كتب وروايات بهيك وقت، هالوقت خاص فيا بيكون وبحب أسوي فيه أشياء أحبها",
      },
      {
        t: "img",
        c: "https://i.imgur.com/BafcFJf.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "المسا",
      },
      {
        t: "p",
        c: "بس نكون خلصنا من شغل النار، والشمس بدأت تضعف، والكهرب يروح معها، بطلع فوق بتخرف مع نباتاتي أنا وزوزو مرات",
      },
      {
        t: "p",
        c: "ومرات بالمسا بطلع على البحر، أو بروح على السوق أتمشى، أو بطلع أشوف وأقعد مع ناس أعرفها",
      },
      {
        t: "p",
        c: "هالوقت أحبه كتير",
      },
      {
        t: "img",
        c: "https://i.imgur.com/1gCjiVF.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "الليل",
      },
      {
        t: "p",
        c: "بعد أذان العشاء، الساعة 9 يعني، بقرأ وردي القرآني اليومي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/MMeiGQC.jpeg",
      },
      {
        t: "p",
        c: "بعدها بسوي العشا، عندي العشا نفس الفطور، رغيف بـ3 تمرات",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بنهي يومي عال10 تقريبا كل يوم",
      },
      {
        t: "p",
        c: "بقرأ أذكار النوم، بفرشي أسناني، بتوضأ، وبستغفر لحد م أنام وأنا مش حاسس على حالي",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "أشياء بسويها بس مش كل يوم",
      },
      {
        t: "p",
        c: "مرات أعبي مية حلوة للأهل فوق، ومرات بعبيها من الزلمة لما ييجي بشتريها يعني",
      },
      {
        t: "h2",
        c: "ومرات بلعب رياضة",
      },
      {
        t: "p",
        c: "مع الأكل هلقيت بديت أبني جسمي تاني، العضل أول اشي رجع عندي، ضايل بدي بس أرجع كم كيلو راحو مني",
      },
      {
        t: "p",
        c: "وزني اللي بدي أوصله هو 60 حاليا، لأنه بيرفكت على طولي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/AfoZMTH.jpeg",
      },
    ],
  },
];

export const latestPost = posts.length;
