export const posts = [
  {
    id: 1,
    meta: {
      duration: "روتين الفترة الحالية",
      year: "12/8/2025",
      summary: "روتين فترة مابعد المجاعة",
    },
    events: [
      {
        t: "h1",
        c: "صباح اليوم",
      },
      {
        t: "p",
        c: "بصحى الساعة 6 يوميا، بصلي الفجر، بقرأ أذكاري، بعدها بسقي نباتاتي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/eLBqJAt.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بعدها بسوي فطوري الخفيف اللطيف",
      },
      {
        t: "p",
        c: "بحشي 3 تمرات على رغيف خبز، وبعمل بعدها كاسة شاي مع سكر طبعااا ✨",
      },
      {
        t: "img",
        c: "https://i.imgur.com/gFXwrqx.jpeg",
      },
      {
        t: "p",
        c: "الخبز عليه شوية رماد من النار لأنه بنخبز مرات على صاج وبيبقى في دخان من النار أسود",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "لما أصحصح - الساعة 11 الصبح",
      },
      {
        t: "p",
        c: "بفتح اللابتوب وبقعد أبرمج ساعة ساعتين متواصل",
      },
      {
        t: "p",
        c: "لازم كل يوم برمجة عندي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/NMBnU4o.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بضيف الأحداث عالموقع",
      },
      {
        t: "p",
        c: "من الأشياء اللي بسويها صرت كل يوم هي إضافة الأحداث هان أول بأول",
      },
      {
        t: "img",
        c: "https://i.imgur.com/3Ny3VJG.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "اللعب من زوزوووو",
      },
      {
        t: "p",
        c: "بتيجينا من الصبح وببقى أقعد معها ألعب وأسليها وأتخرف معها",
      },
      {
        t: "p",
        c: "أحبهااااا",
      },
      {
        t: "img",
        c: "https://i.imgur.com/KKLs8zB.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "طلعة السوق",
      },
      {
        t: "p",
        c: "صارت طلعة السوق اشي شبه يومي هيك من الساعة 9 الصبح بشوف كيف الأسعار بعد ما الدنيا فتحت",
      },
      {
        t: "p",
        c: "مرات بشتري ومرات بس بروح أعرف آخر الأسعار",
      },
      {
        t: "img",
        c: "https://i.imgur.com/P02gj0S.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "منفسي من هالواقع",
      },
      {
        t: "p",
        c: "بس أخلص الدراسة تعت كل يوم، مرات ببقى زهقان وبفتح ألعب",
      },
      {
        t: "p",
        c: "وفي مرات بقرأ كتب وروايات بهيك وقت، هالوقت خاص فيا بيكون وبحب أسوي فيه أشياء أحبها",
      },
      {
        t: "img",
        c: "https://i.imgur.com/BafcFJf.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "المسا",
      },
      {
        t: "p",
        c: "بس نكون خلصنا من شغل النار، والشمس بدأت تضعف، والكهرب يروح معها، بطلع فوق بتخرف مع نباتاتي أنا وزوزو مرات",
      },
      {
        t: "p",
        c: "ومرات بالمسا بطلع على البحر، أو بروح على السوق أتمشى، أو بطلع أشوف وأقعد مع ناس أعرفها",
      },
      {
        t: "p",
        c: "هالوقت أحبه كتير",
      },
      {
        t: "img",
        c: "https://i.imgur.com/1gCjiVF.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "الليل",
      },
      {
        t: "p",
        c: "بعد أذان العشاء، الساعة 9 يعني، بقرأ وردي القرآني اليومي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/MMeiGQC.jpeg",
      },
      {
        t: "p",
        c: "بعدها بسوي العشا، عندي العشا نفس الفطور، رغيف بـ3 تمرات",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بنهي يومي عال10 تقريبا كل يوم",
      },
      {
        t: "p",
        c: "بقرأ أذكار النوم، بفرشي أسناني، بتوضأ، وبستغفر لحد م أنام وأنا مش حاسس على حالي",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "أشياء بسويها بس مش كل يوم",
      },
      {
        t: "p",
        c: "مرات أعبي مية حلوة للأهل فوق، ومرات بعبيها من الزلمة لما ييجي بشتريها يعني",
      },
      {
        t: "h2",
        c: "ومرات بلعب رياضة",
      },
      {
        t: "p",
        c: "مع الأكل هلقيت بديت أبني جسمي تاني، العضل أول اشي رجع عندي، ضايل بدي بس أرجع كم كيلو راحو مني",
      },
      {
        t: "p",
        c: "وزني اللي بدي أوصله هو 60 حاليا، لأنه بيرفكت على طولي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/AfoZMTH.jpeg",
      },
    ],
  },
];

export const latestPost = posts.length;
