export const weeks = [
  {
    id: 32,
    meta: {
      duration: "من 6 أغسطس لـ 12 أغسطس",
      year: 2025,
    },
    events: [
      {
        t: "h1",
        c: "أنا همسك مصاريف البيت",
      },
      {
        t: "p",
        c: "قررت أنا اللي هروح السوق وأهتم بتوزيع الأكل على الأيام",
      },
      {
        t: "p",
        c: "بشوف شو يصير معي، هي اليوم الأربع رحت شريت بـ200 شيكل أكل ليومين",
      },
      {
        t: "p",
        c: "هيني بتعلم وبطور النظام شوي شوي أما هيك أنا بديت أنحف كتير! صرت 50 كيلو وزني",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "نباتاتي 🌱✨",
      },
      {
        t: "img",
        c: "https://i.imgur.com/hHyM0AR.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ep2sQcF.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صور من الحياة",
      },
      {
        t: "p",
        c: "زوزو 💞",
      },
      {
        t: "img",
        c: "https://i.imgur.com/RGrCvCS.jpeg",
      },
      {
        t: "p",
        c: "عملت شاشة من شاشاتي الخضر على انها تخفف قوة الشمس عن نباتاتي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/kKoJGve.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "اليوم التالي: السوق",
      },
      {
        t: "p",
        c: "طلعت زي مبارح عالسوق على حس انه الأسعار نزلت يعني",
      },
      {
        t: "p",
        c: "عموما لقيت 5 كيلو طحين بـ100 شيكل، كيلو السكر بـ55 شيكل، وفي كمان اشياء تانية سعرها نزل شوي زي الزيت السيرج بـ40 شيكل",
      },
      {
        t: "p",
        c: "لسا في أسعار هتنزل كمان، أنا حاليا بستنى التمر المجفف يرخص أكتر من 40 شيكل، هشتريه لما يصير أقل من 20 شيكل",
      },
      {
        t: "img",
        c: "https://i.imgur.com/lFG4UZJ.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/QA0byGJ.jpeg",
      },
      {
        t: "p",
        c: "شريت جبنة وسكر وبتنجان لطبخة المسقعة اليوم الخميس",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صباح الجمعة الأسود",
      },
      {
        t: "img",
        c: "https://i.imgur.com/th3MPGF.png",
      },
      {
        t: "p",
        c: "النتن أصدر قرار باحتلال مدينة غزة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/HzHNVA5.png",
      },
      {
        t: "h1",
        c: "My Reaction",
      },
      {
        t: "p",
        c: "قاعد بجهز بالمقلوبة بطلت تفرق شو يصير لقدام بهالحرب",
      },
      {
        t: "img",
        c: "https://i.imgur.com/NdNV4xa.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/8cww9yx.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "حديقتي المتواضعة جدا 🌱🙂✨",
      },
      {
        t: "img",
        c: "https://i.imgur.com/BftV1Gs.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "عملنا كعك مصري",
      },
      {
        t: "img",
        c: "https://i.imgur.com/nRpsQ5Q.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/tzIuAoo.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/rSTe2mc.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/NBduOlc.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/xNBRzDE.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/NbuSBQ1.jpeg",
      },
    ],
  },
  {
    id: 31,
    meta: {
      duration: "من 30 يونيو لـ 5 أغسطس",
      year: 2025,
      summary: "غزة 2",
    },
    events: [
      {
        type: "goals",
        goal: {
          t: "h1",
          c: "أهداف الأسبوع",
          g: [
            {
              name: "تكملة بشغل البيت",
            },
          ],
        },
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بداية الأسبوع",
      },
      {
        t: "p",
        c: "صحينا صباح يوم الأربع وأفطرنا فلافل وحمص من ايدين أختي ايمان المعدلة، وبعدها تحركنا للبيت عال9",
      },
      {
        t: "img",
        c: "https://i.imgur.com/bkPoCfZ.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/AtMmiQk.jpeg",
      },
      {
        t: "p",
        c: "بعنا كبشة أغراض، كان منيح البيع وخففنا على حالنا كتير أشياء من العفش",
      },
      {
        t: "p",
        c: "اليوم كان الشغل من الـ9 الصبح للـ6 المسا، لما روحنا من البيت الساعة 2 أبو أيهم كان محتاج ايدين معاه",
      },
      {
        t: "p",
        c: "رحتله على محل بلالين وكان وقتها بيفضي بالمحل عشان خلص بده يعطيه لصاحبه، نقلنا كم نقلة لبيت عمي أبو وسيم وخلصنا كل اشي",
      },
      {
        t: "p",
        c: "يوم متعب كان، برتاح الآن وفي عندي نت قوي ونتفلكس بحضر فيه الآن",
      },
      {
        t: "p",
        c: "وصحيح صلحت البسكليت اللي كانت عنا من زمان",
      },
      {
        t: "img",
        c: "https://i.imgur.com/He5EPS8.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "اليوم التالي - يوم الخميس",
      },
      {
        t: "p",
        c: "بهاليوم كنا مخلصين شغل بالطابق الأول كله، وقعدنا نشتغل عالسطح طول اليوم، كنت بنظف أغلب الوقت وابو أيهم قاعد بيصور وبينزل ستوريات",
      },
      {
        t: "img",
        c: "https://i.imgur.com/2VGm5q1.jpeg",
      },
      {
        t: "p",
        c: "وبس خلصنا شغل خلص أجا موعد الرواح",
      },
      {
        t: "p",
        c: "أنا كنت مخطط بدي أروح عالدير بالبسكليت، لكن للأسف لقيت العجل مبعوط",
      },
      {
        t: "img",
        c: "https://i.imgur.com/KFOmfFB.jpeg",
      },
      {
        t: "p",
        c: "الساعة 3 كنا راكبين ومروحين على دير بالبلح",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "مجموعة صور من المشوار",
      },
      {
        t: "img",
        c: "https://i.imgur.com/iA8uaN2.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/OLBV6th.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/B64WzUr.jpeg",
      },
      {
        t: "p",
        c: "كان في جرة غاز لسا فيها 👀",
      },
      {
        t: "img",
        c: "https://i.imgur.com/a71WImd.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/RaOgy8g.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/edgQGSz.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/cXpJs5z.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/1ji9zoH.jpeg",
      },
      {
        t: "h1",
        c: "صورت كبشة فيديوهات - بفكر أعمل مونتاج وانزله هان",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "نباتاتي بعد غياب 🌱✨",
      },
      {
        t: "p",
        c: "وصيت كل أهل الدار عليهم 🌚",
      },
      {
        t: "img",
        c: "https://i.imgur.com/9dxMEWB.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "الرجعة لغزة",
      },
      {
        t: "p",
        c: "ارتحنا يوم الجمعة بالدير ورجعنا صباح تاني يوم",
      },
      {
        t: "h2",
        c: "يوم السبت",
      },
      {
        t: "p",
        c: "وصلنا على موعد الشغل بالزبط",
      },
      {
        t: "img",
        c: "https://i.imgur.com/2T74Nvq.jpeg",
      },
      {
        t: "p",
        c: "أفطرنا وقلنا يلا بسم الله بنشتغل",
      },
      {
        t: "img",
        c: "https://i.imgur.com/5yuxVn8.jpeg",
      },
      {
        t: "p",
        c: "بدأنا بالسطح نشتغل ترتيب عشان هنجيب من تحت اغراض كتير",
      },
      {
        t: "img",
        c: "https://i.imgur.com/BLl3qOn.jpeg",
      },
      {
        t: "p",
        c: "عرضنا فرش للبيع",
      },
      {
        t: "img",
        c: "https://i.imgur.com/GRW53Yl.jpeg",
      },
      {
        t: "p",
        c: "ولقينا جهاز UPS كيلو، هالجهاز النا طبعا",
      },
      {
        t: "img",
        c: "https://i.imgur.com/icRrJLY.jpeg",
      },
      {
        t: "p",
        c: "صورة واحنا مخلصين من يوم السبت",
      },
      {
        t: "img",
        c: "https://i.imgur.com/iYbourD.jpeg",
      },
      {
        t: "h2",
        c: "كم صورة من الشارع واحنا ماشيين",
      },
      {
        t: "img",
        c: "https://i.imgur.com/7S6o6tB.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/sIR9n6W.jpeg",
      },
      {
        t: "h1",
        c: "انجرحت جرح محتاج غُرَز",
      },
      {
        t: "p",
        c: "وانا باقي بطلع الأغراض لفوق كان في قزاز مكسور على الأرض، خبطت برجلي عليهم وهيني للآن بعرج",
      },
      {
        t: "p",
        c: "مش هنزل صورة الجرح هان طبعا لأنه بيخوف شوي 😀",
      },
      {
        t: "hr",
      },
      {
        t: "p",
        c: "الآن هينا بنرتاح في بيت عمي أبو وسيم بنرجع بكرا نكمل شغل",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "يوم الأحد",
      },
      {
        t: "p",
        c: "كنا متفقين مع عربية تندر على مبلغ نوعا ما منيح على انه ييجي وننقل الاغراض من بيتنا للدير",
      },
      {
        t: "p",
        c: "أجا من الساعة 10 وبدأنا ننقل الأغراض من السطح (الطابق الثالث) للأرض تحت",
      },
      {
        t: "p",
        c: "كل اشي كان ماشي تمام الا لما خلصنا الشغل وحسيت في اشي غلط",
      },
      {
        t: "p",
        c: "أصله البشمهندس أبو أيهم باقي جايب 2 من الشارع يشيلو معانا",
      },
      {
        t: "p",
        c: "حسيت في خبث في أشكالهم ف رحت قبل م الشباب يخلصو من النقل وحسيت انه جوالي صارله اشي",
      },
      {
        t: "p",
        c: "خلص هيك سبحان الله اجاني احساس انه الجوال متاخد من الشابين هدول",
      },
      {
        t: "p",
        c: "كنت وقتها معصب وانفجرت في وجههم وعملت لمة ناس بهالشارع عليهم",
      },
      {
        t: "p",
        c: "المهم بالأخر خلوني لحالي وبعدوني عنهم وابوي وابو أيهم حاولو يتحايلو عليهم انه يعمي الجوال مش منيح ومش مستاهل ينسرق يعني",
      },
      {
        t: "p",
        c: "وهالشابين بيحكو احنا اولاد ناس وابصر شو وهما اصلا مبينين مش اولاد ناس ولا غيرو ابصر حتى بيعرفو الله",
      },
      {
        t: "p",
        c: "عموما بالأخير قلنالهم يعمي اذا ناقصكو مصاري هي المصاري بس هاتو هالجوال",
      },
      {
        t: "p",
        c: "والله وهيك مرة وحدة اعترفو بعد م عاهدونا على الله وسنة رسوله انهم ما اخدوه 🙂",
      },
      {
        t: "p",
        c: "وبس هيك رجعلي جوالي بعد هالخرابة، عموما بكرا هنكمل ان شاء الله",
      },
      {
        t: "p",
        c: "صرنا مخلصين 95% من الغرفة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/YzV952C.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "آخر اخبار الجرح",
      },
      {
        t: "p",
        c: "الحمدلله بدأ يلتئم، خلص خليته مكشوف عالهوا عشان ينشف اكتر ويطيب اسرع",
      },
      {
        t: "p",
        c: "البيئة عندي نظيفة دايما والجرح مافيه اي التهابات",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "أحداث من الواقع",
      },
      {
        t: "p",
        c: "بدأت الأمور تتحسن شوي شوي، الأسعار طبعا لساتها غالية، كيلو الطحين اليوم الأحد سعره 30 شيكل",
      },
      {
        t: "p",
        c: "بس المصيبة انه فش غير الطحين والعدس والرز بالأسواق",
      },
      {
        t: "p",
        c: "كيلو السكر وصل 600 شيكل وأكثر!",
      },
      {
        t: "h3",
        c: "أخبار من العيلة",
      },
      {
        t: "p",
        c: "أختي ايمان صارت بالشهر الثامن في نصه",
      },
      {
        t: "p",
        c: "فيها ولد لسا مش معروف شو هيسموه، يمكن على اسمي محمد، لانه عنده عم وخال اسمهم محمد 🙂",
      },
      {
        t: "p",
        c: "يلا على خير ان شاء الله",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "اليوم التالي: الإثنين",
      },
      {
        t: "p",
        c: "بدأنا بتفكيك الرفوف عشان كنا مخططين هناخدهم بكمان نقلة هاليوم",
      },
      {
        t: "img",
        c: "https://i.imgur.com/NBYlCMk.jpeg",
      },
      {
        t: "h1",
        c: "خلصنا من الغرفة اللي فوق",
      },
      {
        t: "p",
        c: "خلص كل الأغراض هيك صارت على السطح",
      },
      {
        t: "img",
        c: "https://i.imgur.com/a9LZ5a3.jpeg",
      },
      {
        t: "h1",
        c: "طيارة المساعدات كل شوي تمر من فوقنا",
      },
      {
        t: "p",
        c: "وولا مرة شفتها بترمي اشي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Au8vaAy.jpeg",
      },
      {
        t: "h1",
        c: "بعد هيك عالساعة 3 كنا راكبين ومرحين على الدير",
      },
      {
        t: "img",
        c: "https://i.imgur.com/wMQxy0T.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/tQTQsXP.jpeg",
      },
      {
        t: "p",
        c: "وصلنا العصر، هلقيت راحة وبنقعد يومين بالدير نرتب الأغراض وبنرجع على غزة تاني",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "اليوم التالي - الثلاثاء",
      },
      {
        t: "p",
        c: "صحيت من الـ8، بعد نومة 12 ساعة كاملين على سريري لأول مرة من سنة ونص",
      },
      {
        t: "p",
        c: "أحلى وأريح نومة من فترة كبيرة",
      },
      {
        t: "p",
        c: "المهم هلقيت صرت مركب خزانتي، وهي سريري كمان، ضايل كمان ترتيب وان شاء الله اليوم بنكون مخلصين من كل الخزانات ومرتبين الأعراض",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "من الأشياء اللي لقيناها هناك وجبناها",
      },
      {
        t: "p",
        c: "لقينا 4 لتر زيت زيتون، مرطبان عسل، كبشة سكر، كبشة ملابس، وجبنا معنا ups بطارية",
      },
      {
        t: "p",
        c: "هالups ممكن يتحول لجهاز طاقة ينظم اللي جاي من الخلية",
      },
      {
        t: "p",
        c: "وجبت كبشة اغراض الي هبقى انزل صور الها بس أخلص شغل الأول",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صور من الأغراض اللي جبتهم معي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/7nmMO3r.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/wRcRKEi.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صور بعد ترتيب الأغراض",
      },
      {
        t: "img",
        c: "https://i.imgur.com/WLNsqrX.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/SHiMT5B.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/q5fyyvM.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/z4rM0hr.jpeg",
      },
    ],
  },
  {
    id: 30,
    meta: {
      duration: "من 23 يوليو لـ 29 يوليو",
      year: 2025,
      summary: "بيع أغراض من البيت 1",
    },
    events: [
      {
        type: "goals",
        goal: {
          t: "h1",
          c: "أهداف الأسبوع",
          g: [
            {
              name: "كل يوم على الأقل 5 ساعات دراسة",
              isFailed: true,
            },
          ],
        },
      },
      {
        t: "hr",
      },
      {
        t: "h3",
        c: "Timelapse of the Week",
      },
      {
        t: "p",
        c: "بتعلم PostgreSQL بشكل أعمق",
      },
      {
        t: "iframe",
        type: "shorts",
        videoId: "1HrEDFynJxI",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صور من الحياة",
      },
      {
        t: "p",
        c: "زينة بتكبر 💞",
      },
      {
        t: "img",
        c: "https://i.imgur.com/l1ytgJs.jpg",
      },
      {
        t: "h3",
        c: "صباح اليوم الرابع من الزراعة: السلق والجرجير طلعو",
      },
      {
        t: "p",
        c: "الحمدلله يارب قريت عليهم قرآن لما قلت بس 😄❤️ الله يبارك فيهم وناكلهم بيوم من الأيام",
      },
      {
        t: "img",
        c: "https://i.imgur.com/OVG8W6y.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h3",
        c: "جهزت حبة بطاطا للزراعة ✨",
      },
      {
        t: "img",
        c: "https://i.imgur.com/dft7AUn.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h3",
        c: "شرينا طحين",
      },
      {
        t: "p",
        c: "الشحنيات رجعت تدخل تاني، طبعا اللي بيلحق ياخد بياخد، احنا شرينا 2 كيلو نمشي حالنا فيهم وناكل منيح",
      },
      {
        t: "p",
        c: "عملنا فطاير بالسلق والبطاطا، بوتاسيوم وبروتين للجسم، الحمدلله يارب",
      },
      {
        t: "img",
        c: "https://i.imgur.com/uyL2dUp.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/gN9L6W1.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/jo7nXhE.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "أحداث من الواقع",
      },
      {
        t: "p",
        c: "يوم الخميس 24 يوليو",
      },
      {
        t: "p",
        c: "عشان أفطر طلعت بهال5 شيكل",
      },
      {
        t: "img",
        c: "https://i.imgur.com/AFtzxbZ.jpeg",
      },
      {
        t: "p",
        c: "جبت مكمل غذائي صغنون وشوية بذور ملوخية أزرعهم عشان نتغدى فيهم كمان 40 يوم 🙂",
      },
      {
        t: "img",
        c: "https://i.imgur.com/7zEARVG.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/TwSe7ek.jpeg",
      },
      {
        t: "h3",
        c: "وفي كمان شوية انخفاض بالأسعار عنا بالدير",
      },
      {
        t: "p",
        c: "كيلو الطحين صار 50 شيكل، ومتوفر بكمية منيحة، بس لسا الرز والعدس والباقي مش موجود",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صباح اليوم التالي: الزراعة - اليوم الخامس",
      },

      {
        t: "img",
        c: "https://i.imgur.com/amzZQtm.jpeg",
      },
      {
        t: "p",
        c: "كمان بذور بدأت تنبت",
      },
      {
        t: "img",
        c: "https://i.imgur.com/WCRu6Gf.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/s5IQobE.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صنعت سماد منزلي",
      },
      {
        t: "p",
        c: "من قشر الخضار اللي كنا نرميه، صرت أحطه بمية حلوة ويومين باخد المية وبسقي فيها الزرع",
      },
      {
        t: "p",
        c: "طبعا كمان القشر ببقى بحطه بالرمل يتحلل ويفيد النباتات المزروعة",
      },
      {
        t: "p",
        c: "حاليا قشر بطاطا + سيقان سلق مقطعة - عالم من البوتاسيوم للنباتات",
      },
      {
        t: "img",
        c: "https://i.imgur.com/bnuCPTJ.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/sGGVb1Z.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "p",
        c: "بدرس برمجة من موقع W3Schools - جبت المركز الأول بيومين - هو عادي بس بحب اكون الأول 🙂✨",
      },
      {
        t: "img",
        c: "https://i.imgur.com/f0o6GnV.jpeg",
        isLightImage: true,
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "طلعنا نشوف المساعدات",
      },
      {
        t: "p",
        c: "على أساس انه في شاحنات بتيجي على شارع صلاح الدين - روحنا على الفاضي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/4kxa4nj.jpeg",
      },
      {
        t: "p",
        c: "بالأخير جبنا 2 كيلو ونص طحين على 100 شيكل 🙂💔",
      },
      {
        t: "img",
        c: "https://i.imgur.com/MX30Yg9.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بالليلة زرعت الملوخية",
      },
      {
        t: "p",
        c: "عملت ديكور جديد كمان -  القلعة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/50YpY1e.jpeg",
      },
      {
        t: "h1",
        c: "صباح تاني يوم",
      },
      {
        t: "p",
        c: "النباتات بخير الحمدلله",
      },
      {
        t: "img",
        c: "https://i.imgur.com/qOmQgFQ.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/p2NHptf.jpeg",
      },
      {
        t: "h3",
        c: "البطيخ طلع 🍉🌱",
      },
      {
        t: "img",
        c: "https://i.imgur.com/GfdX0di.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "شوي وبخلص كورس SQL",
      },
      {
        t: "img",
        c: "https://i.imgur.com/iq91TRD.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "من اختراعات الحرب",
      },
      {
        t: "p",
        c: "فلافل محمص",
      },
      {
        t: "img",
        c: "https://i.imgur.com/0Zsd9jB.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/rHKg3VL.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/81k7KAI.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/WL0zyHD.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صباح يوم 25 - صحيت مرضان",
      },
      {
        t: "p",
        c: "بلعت ريقي مرتين ولسا البلع بياجع الزور - وهنا عرفت انها الانفلونزا",
      },
      {
        t: "p",
        c: "هدتني هد - هيني بحاول أرتاح وأشرب مية كتير",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صباح اليوم التالي",
      },
      {
        t: "p",
        c: "عملت مصانع للكومبوست - العلبتين هدول بيعطو تغذية للجذور بشكل كبير وبعد شهر بيصير عندي الـكومبوست",
      },
      {
        t: "p",
        c: "الكومبوست هو الرمل الأسود الحلو اللي بيكون عبارة عن تحلل النباتات - بيتاخد وبينحط كـ سماد على الرمل",
      },
      {
        t: "img",
        c: "https://i.imgur.com/nUlsY9y.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "الزراعة - بعد أسبوع",
      },
      {
        t: "p",
        c: "عملت حماية جديدة من العصافير",
      },
      {
        t: "img",
        c: "https://i.imgur.com/OQYoTWL.jpeg",
      },
      {
        t: "p",
        c: "صور من قريب",
      },
      {
        t: "img",
        c: "https://i.imgur.com/MNPXwEW.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "خلصت كورس الـ SQL",
      },
      {
        t: "p",
        c: "حتى مع المرض قررت بكمل، المهم اخدت كويز وجبت علامة كاملة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Ld2y5DF.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "مشوار غزة الرابع",
      },
      {
        t: "p",
        c: "تحركنا من الساعة 8 الصبح لغزة، الهدف من الطلعة هي تفقد اغراض البيت ومحاولة لبيع أي اشي بنقدر عليه",
      },
      {
        t: "p",
        c: "نقلنا كل اغراض علاء من تحت لفوق، وشفنا نجار مهتم انه يشتري طقم نوم والخزنات من البيت",
      },
      {
        t: "p",
        c: "من الساعة 8 للـ 3 قعدنا، بعد هيك روحنا على الدير وجبنا معنا شوية حجات من البيت",
      },
      {
        t: "p",
        c: "لقيت مرطبان عسل 🍯",
      },
      {
        t: "p",
        c: "صور من المشوار",
      },
      {
        t: "img",
        c: "https://i.imgur.com/b2MrhbL.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/v7IGLdj.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/BugwfTB.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/N9MwvH3.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/g3GW9rU.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/mjsLe47.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/irEIu1R.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "تاني يوم - الثلاثاء 29 يونيو",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ht17bjX.jpeg",
      },
      {
        t: "p",
        c: "رجعنا تاني على غزة، الهدف هو البيع، تحركنا الساعة 9 ونص الصبح ووصلنا هناك بعد ساعة",
      },
      {
        t: "p",
        c: "لما وصلنا عالسريع بدأنا تنظيف وترتيب، وبدأنا نصور ونعرض على صفحة بلالين ستوري انستاغرام",
      },
      {
        t: "p",
        c: "وماشاءالله كل دقيقة اتصال وزبون ييجي يشوف شغلة يشتريها، عنده الستوري بيوصل ل 20 ألف مشاهدة عشان",
      },
      {
        t: "p",
        c: "قدرنا نبيع طقم نوم كامل، وشوية طناجر جديدة ومراوح بطارية وغاز، قعدنا هناك لحد الساعة 2 ونص",
      },
      {
        t: "p",
        c: "عشان مربوطين بموعد شغل العيادة، لازم عال2 نروح، وقعدنا في بيت عمي أبو وسيم الدكتور عايش شومان",
      },
      {
        t: "p",
        c: "ماقصرو معانا بحاجة الحمدلله مشكورين على كل اشي",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "التكملة بالأسبوع اللي وراه",
      },
      {
        t: "p",
        c: "مع الصور اللي صورتها كمان",
      },
    ],
  },
  {
    id: 29,
    meta: {
      duration: "من 16 يوليو لـ 22 يوليو",
      year: 2025,
      summary: "بدأت زراعة | أصعب أيام الحرب",
    },
    events: [
      {
        type: "goals",
        goal: {
          t: "h1",
          c: "أهداف الأسبوع",
          g: [
            {
              name: "الاستمرارية على كل شيء مفيد",
              isDone: true,
            },
          ],
        },
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "هخلي الـAI يدرسني هالأسبوع ",
      },
      {
        t: "img",
        c: "https://i.imgur.com/h2xBzlL.jpeg",
        isLightImage: true,
        size: "extra-small",
      },
      {
        t: "img",
        c: "https://i.imgur.com/dSWWUk3.jpeg",
      },
      {
        t: "p",
        c: "انا ماكنت بستخدم الـAI وقت الدراسة عشان كنت بدي أحك مخي وانا بحاول افهم",
      },
      {
        t: "p",
        c: "بس مش معنى انه هيصير يدرسني انه هيخليني ابطل افكر",
      },
      {
        t: "p",
        c: "انا هستخدمه عشان يشرحلي المواضيع بشكل مبسط بس مش اكتر",
      },
      {
        t: "p",
        c: "يعني انا اللي هكتب الكود واسوي التفكير والحلول",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "المعاناة اليومية",
      },
      {
        t: "img",
        c: "https://i.imgur.com/DJjhwf3.jpeg",
      },
      {
        t: "p",
        c: "قبل هالحرب كنت باكل خير الله أكل، وسفرتنا عمرها مافضيت..",
      },
      {
        t: "p",
        c: "واليوم هيني واقف على الدور بطنجرة، بتحسر على الايام اللي راحت",
      },
      {
        t: "p",
        c: "الحرب كسرت ظهري ونزلتني للشارع",
      },
      {
        t: "p",
        c: "بس انا قلبي لسا مش مستسلم، وبتفائل وبقول اللي جاي احسن",
      },
      {
        t: "p",
        c: "ف يارب خيرك كتير واحنا تعبنا",
      },
      {
        t: "h3",
        c: "الحمدلله ❤️‍🩹",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صور من الحياة",
      },
      {
        t: "p",
        c: "زوزو صارت تعرف تمسك الحجات بإيديها",
      },
      {
        t: "img",
        c: "https://i.imgur.com/hai1Grm.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/7Ia6fCd.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h3",
        c: "حصة الأسبوع كانت مقدمة بالبرمجة بجافاسكريبت",
      },
      {
        t: "p",
        c: "الحمدلله الشب فهم منيح، صورة وهو بيطبق عملي معي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/XYisrbu.jpeg",
      },
      {
        t: "p",
        c: "يسلمو ايديها خالتو أم عبدالله 💗",
      },
      {
        t: "img",
        c: "https://i.imgur.com/bzEi6iO.jpeg",
      },
      {
        t: "p",
        c: "طبعا وقت الأكل اتفرجنا على فيلم 🔥🌚",
      },
      {
        t: "p",
        c: "حصة ممتعة كانت الي وللشب",
      },
      {
        t: "hr",
      },
      {
        t: "h3",
        c: "بديت زراعة",
      },
      {
        t: "p",
        c: "حاليا زارع فلفل وشمام، طلعو معي الحمدلله وهيني بسقيهم كل يوم",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Lfsutdj.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/FsYvDsL.jpeg",
      },
      {
        t: "p",
        c: "في عندي بذور بتنجان حطيتهم بصحن بقطن رطب، ولسا بدي اجيب بندورة وبطاطا",
      },
      {
        t: "h3",
        c: "ان شاء الله بييجي يوم بناكل منهم",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "تاني يوم",
      },
      {
        t: "p",
        c: "فوق في رمل جبناه مرة ومازرعنا فيه، ف رتبت المنطقة وهزرع فيها ان شاء الله",
      },
      {
        t: "h3",
        c: "قبل",
      },
      {
        t: "img",
        c: "https://i.imgur.com/cZxwHba.jpeg",
      },
      {
        t: "h3",
        c: "بعد",
      },
      {
        t: "img",
        c: "https://i.imgur.com/CqTHbB6.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "احداث من الواقع",
      },
      {
        t: "p",
        c: "اليوم 18 يوليو سعر كيلو الطحين 160 شيكل ",
      },
      {
        t: "p",
        c: "وبس هيك الحياة صارت",
      },
      {
        t: "p",
        c: "اه وكمان صار اللي عنده خبز زي اللي عنده دهب، الاسواق جافة من كل شيء ممكن يسد الجوع، تعون الفلافل صارو زحمة كبيرة كتير عليهم",
      },
      {
        t: "p",
        c: "عايشين أسوأ مرحلة حرفيا",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "براجع بالـReact",
      },
      {
        t: "p",
        c: "برمجت لعبة اكس اوه",
      },
      {
        t: "img",
        c: "https://i.imgur.com/5eBUlNi.png",
        size: "small",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "اليوم التالي: الزراعة",
      },
      {
        t: "p",
        c: "طلعت مشوار جبت بذور سلق وجرجير، وكمان جبت سماد",
      },
      {
        t: "img",
        c: "https://i.imgur.com/yl3kwdV.jpeg",
      },
      {
        t: "p",
        c: "خلطت معلقة صغيرة على 20 لتر مية، عشان لسا بذور، لما تكبر النبتة ويصير عمرها حوالي اسبوعين بحط معلقة كبيرة على 20 لتر",
      },
      {
        t: "img",
        c: "https://i.imgur.com/btIzkME.jpeg",
      },
      {
        t: "p",
        c: "الجرجير",
      },
      {
        t: "img",
        c: "https://i.imgur.com/GVyycQx.jpeg",
      },
      {
        t: "p",
        c: "السلق",
      },
      {
        t: "img",
        c: "https://i.imgur.com/yW2IVRE.jpeg",
      },
      {
        t: "p",
        c: "جبت رمل من الأرض تحت",
      },
      {
        t: "img",
        c: "https://i.imgur.com/rAsdXoE.jpeg",
      },
      {
        t: "p",
        c: "بجهز بالمكان",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Kz21U4L.jpeg",
      },
      {
        t: "p",
        c: "جهز",
      },
      {
        t: "img",
        c: "https://i.imgur.com/CHB3UhS.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/12IfvyK.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/MtBT1KE.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/RIIFZ6Z.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/2Jsapky.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/VWXXf3b.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/RIIFZ6Z.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/D1STWqv.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "اليوم التالي للزراعة",
      },
      {
        t: "p",
        c: "وسعت المساحة وزرعت كمان بذور",
      },
      {
        t: "img",
        c: "https://i.imgur.com/0zD18xU.jpeg",
      },
      {
        t: "p",
        c: "الشمام بدأ ينعنش",
      },
      {
        t: "img",
        c: "https://i.imgur.com/q5aYt1t.jpeg",
      },
      {
        t: "h2",
        c: "أصلا أنا مش عارف ليه بجتهد هلقد أصله في اخلاءات قريبة من المكان",
      },
      {
        t: "p",
        c: "الله يستر",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بديل الخبز 🙂",
      },
      {
        t: "p",
        c: "الطحين انقطع من البلد، ف بدنا حل يعني، انا مش متخيل ولا مصدق اللي قاعد بيصير، الحمدلله على كل حال",
      },
      {
        t: "p",
        c: "ورق العنب مع فلافل وبتنجان مقلي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Hxg6Ncg.jpeg",
      },
      {
        t: "p",
        c: "وللتحلاية جبنا بطيخ، طبعا اخدت البذر وهزرعه 😀",
      },
      {
        t: "img",
        c: "https://i.imgur.com/KLX6mAg.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "أكلت لحمة",
      },
      {
        t: "p",
        c: "لحمة بلح البحر، أول مرة بحياتي اكله، كتير زاكي طلع، مصدر بروتين وحديد واوميغا 3 قوي جدا",
      },
      {
        t: "img",
        c: "https://i.imgur.com/GKXJXWW.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "كمان لحمة ✨😄",
      },
      {
        t: "p",
        c: "الحمدلله، يارب ديمها من نعمة ❤️",
      },
      {
        t: "img",
        c: "https://i.imgur.com/S6cqFMQ.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/75c2V2f.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/1gNjWPf.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "زرعت كمان",
      },
      {
        t: "p",
        c: "هالمرة فلفل زرعت",
      },
      {
        t: "img",
        c: "https://i.imgur.com/eUOWd4Z.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "اليوم التالي للزراعة",
      },
      {
        t: "p",
        c: "لاحظت العصافير بتاكل ورق النبات عندي/ ف حطيت شبك حماية",
      },
      {
        t: "img",
        c: "https://i.imgur.com/uYrYe8j.jpeg",
      },
      {
        t: "p",
        c: "الحمدلله كمان نباتات بدأت تطلع",
      },
      {
        t: "img",
        c: "https://i.imgur.com/0pv2axP.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "سويت فستق",
      },
      {
        t: "p",
        c: "اسناني للآن بتاجعني 🙂💔",
      },
      {
        t: "img",
        c: "https://i.imgur.com/J8THsd5.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "I'm so back",
      },
      {
        t: "p",
        c: "مراجعة بشكل سريع على اللي تعلمته من جديد",
      },
      {
        t: "img",
        c: "https://i.imgur.com/TxAlSQs.jpeg",
      },
    ],
  },
  {
    id: 28,
    isSpecial: true,
    meta: {
      duration: "من 9 يوليو لـ 15 يوليو",
      year: 2025,
      summary: "صلحت لابتوبي وجوالي 🙂🔥",
    },
    events: [
      {
        type: "goals",
        goal: {
          t: "h1",
          c: "أهداف الأسبوع",
          g: [
            {
              name: "أرجع أكمل دورة نود",
              isDone: true,
            },
            {
              name: "الالتزام بالعادات الجديدة",
              isDone: true,
            },
            {
              name: "رياضة كل يوم",
              isDone: true,
            },
          ],
        },
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "شاحن لابتوبي خرب",
      },
      {
        t: "p",
        c: "أكيد السبب من الكهرب، شاحن لابتوبي بطل يشتغل، هروح أشوف حد يصلحه",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صلحت اللابتوب والجوال",
      },
      {
        t: "p",
        c: "رحت أدور محل بيصلح شواحن لابتوب ولقيت محل مختص بالجوالات بالأصل، فسألت وحكالي بينفع",
      },
      {
        t: "p",
        c: "المهم سألت كمان اذا بيقدر يصلح الجوال كمان، الجوال عندي كان بده تبديل بطارية مع الجوال التاني",
      },
      {
        t: "p",
        c: "أصله انا عندي جوالين آيفون 7 ف باخد من هاد وبحظ بالتاني",
      },
      {
        t: "p",
        c: "سويته وطلع كمان بده برمجة، أخدته عندي وبرمجته من لابتوبي وهيو شغال الآن",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "آخر الاضافات لسيرفري",
      },
      {
        t: "p",
        c: "عملت أربع أنمطة للشاشة الرئيسية",
      },
      {
        t: "p",
        c: "من احد الاقتراحات 🌚💞",
      },
      {
        t: "img",
        c: "https://i.imgur.com/y22Qu38.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/2Q5278u.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/SG9x6CY.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/uMp9dKc.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/omVUR2p.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "نرجع تاني لصور من الحياة",
      },
      {
        t: "p",
        c: "أول صورة بالجوال بعد ماشتغل",
      },
      {
        t: "img",
        c: "https://i.imgur.com/svMade8.jpeg",
        size: "small",
      },
      {
        t: "p",
        c: "زينة أربع شهور صارت 💞",
      },
      {
        t: "img",
        c: "https://i.imgur.com/7aAiThY.jpeg",
      },
      {
        t: "img",
        c: "http://i.imgur.com/o9Aye8s.jpg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/epuWBJP.jpeg",
      },
      {
        t: "p",
        c: "من الحياة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/AGo7A3h.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/pu9qS0V.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/79Q2CYu.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/DndH4yu.jpeg",
      },
      {
        t: "p",
        c: "بطاطس حلوة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Gm8z57r.jpeg",
      },
      {
        t: "p",
        c: "شمام",
      },
      {
        t: "img",
        c: "https://i.imgur.com/CRaE05q.jpeg",
      },
      {
        t: "p",
        c: "طبيخ بطاطس",
      },
      {
        t: "p",
        c: "مش كل يومين عدس برضو 🙂",
      },
      {
        t: "img",
        c: "https://i.imgur.com/VxF1UgZ.jpeg",
      },
      {
        t: "h1",
        c: "من الحصة رقم 15",
      },
      {
        t: "p",
        c: "كانت عن اساسيات اللابتوبات والشاشات",
      },
      {
        t: "img",
        c: "https://i.imgur.com/HfdCNg6.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "أحداث من الواقع",
      },
      {
        t: "p",
        c: "بنعيش بأسوأ أيام الحرب حرفيا، الروحة عالسوق بتسد النفس",
      },
      {
        t: "p",
        c: "مافي غير شوية خضار، وفاكهة يادوب، ورز وعدس وطحين",
      },
      {
        t: "p",
        c: "بهاد الفترة منتشر بيع الفلافل، ال3 أقراص ب2 شيكل",
      },
      {
        t: "p",
        c: "السكر بينباع ب400 شيكل، كيلو الطحين صار 70 شيكل، كل اشي صار سعره ضرب خمسين و أكتر",
      },
      {
        t: "p",
        c: "وبنفس الوقت في حكي عن ادخال مساعدات للناس تاكل، طيب ليش هيك يعني بيستنو الناس تموت من الجوع؟! عالم وسخ",
      },
      {
        t: "p",
        c: "الوضع صعب الله يهونها بس من شدة",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بكمل بدورة الـNode",
      },
      {
        t: "p",
        c: "صرلي 3 اسابيع موقف عشان شغل السيرفر كان مستهلك كل تركيزي",
      },
      {
        t: "p",
        c: "حاليا براجع بآخر اشي وصلته",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "كمان شوية صور عشان عمرت الجوال بس",
      },
      {
        t: "p",
        c: "الواحد عشان ياكل بيجيب فرشوحتين وكم قرص فلافل وشوية مقالي",
      },
      {
        t: "p",
        c: "تكلفة الاكلة هاد اللي كانت بشيكلين صارت ب20 هلقيت",
      },
      {
        t: "img",
        c: "https://i.imgur.com/t0NVsSE.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/UNXqBt2.jpeg",
      },
      {
        t: "h1",
        c: "الحمدلله",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ms9MKPl.jpeg",
      },
    ],
  },
  {
    id: 27,
    meta: {
      duration: "من 2 يوليو لـ 8 يوليو",
      summary: "عدت برمجة سيرفري",
      year: 2025,
    },
    events: [
      {
        type: "goals",
        goal: {
          t: "h1",
          c: "أهداف الأسبوع",
          g: [
            {
              name: "أعيد ترتيب وبرمجة سيرفري",
              isDone: true,
            },
            {
              name: "رياضة كل يوم",
              isDone: true,
            },
          ],
        },
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "غيرت على شكل السيرفر عالجوال",
      },
      {
        t: "img",
        c: "https://i.imgur.com/cBe0sl0.png",
      },
      {
        t: "p",
        c: "لسا بدي أشتغل على تصميم اللابتوب",
      },
      {
        t: "p",
        c: "بفكر أخليه زي تصميم النظام تاع لابتوبي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/hOQaUNq.jpeg",
      },
      {
        t: "p",
        c: "زي هيك",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "اليوم التالي",
      },
      {
        t: "p",
        c: "التصميم الجديد جهز",
      },
      {
        t: "img",
        c: "https://i.imgur.com/7mosrM1.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/azZ4LAk.jpeg",
      },
      {
        t: "p",
        c: "ضايل أشتغل جزئية اليوتيوب والبودكاست، الملفات جاهزة بس ضايل التجهيز",
      },
      {
        t: "hr",
      },
      {
        t: "p",
        c: "الأسبوع هاد طار طيارة هيك بسرعة مشي",
      },
      {
        t: "p",
        c: "المهم انجزت وعملت التالي",
      },
      {
        t: "p",
        c: "سويت refactoring للسيرفر تاعي، استخدمت الـMVC باترن لترتيب الكود بالملفات",
      },
      {
        t: "p",
        c: "وضفت زر اعدادات، وزر لايك ودسلايك لليلزات، مع تطبيق الوظائف المناسبة لكل زر",
      },
      {
        t: "p",
        c: "اشتغلت بجزئية اليوتيوب، كتير طولت معي! المهم هي صور لآخر اشي وصلتله",
      },
      {
        t: "img",
        c: "https://i.imgur.com/PvJNcxF.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/9fmeTf6.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/57QRNSt.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/19ijAI1.jpeg",
      },
    ],
  },
  {
    id: 26,
    meta: {
      duration: "من 25 يونيو لـ1 يوليو",
      summary: "صنعت أول سيرفر كامل",
      year: 2025,
    },
    events: [
      {
        type: "goals",
        goal: {
          t: "h1",
          c: "أهداف الأسبوع",
          g: [
            {
              name: "أخلص الشغل على سيرفري",
              isDone: true,
            },
            {
              name: "تمارين رياضة كل يوم",
              isDone: true,
            },
          ],
        },
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صنعت سيرفر محلي",
      },
      {
        t: "p",
        c: "يومين شغل واكتر من 10 ساعات شغل، وصلت لموقع شغال",
      },
      {
        t: "p",
        c: "هاد السيرفر هيكون في حال قطع النت، او بأي وقت للي بده يتفرج على فيلم",
      },
      {
        t: "p",
        c: "سيرفر محلي يعني أي شخص شابك معي بنفس الشبكة بيقدر يفتحه ويشوفه",
      },
      {
        t: "p",
        c: "هيكون أفلام ومسلسلات وكتب",
      },
      {
        t: "p",
        c: "حاليا الأفلام صارو 60% جاهزين",
      },
      {
        t: "img",
        c: "https://i.imgur.com/PT50xGS.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/5tgJdpO.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/AatwBA2.jpeg",
      },
      {
        t: "p",
        c: "لسا بده شغل",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "تحديثات على سيرفري الأول",
      },
      {
        t: "p",
        c: "اليوم السبت، بيصيرلي 3 أيام شغال على السيرفر",
      },
      {
        t: "p",
        c: "كتير بياخد وقت مني، برتب البيانات وبعرضها وبزبطها، اشي مش سهل، يمكن عشان لسا جديد انا على هاد الشغل",
      },
      {
        t: "p",
        c: "المهم، صرت مخلص من الأفلام، تقريبا يعني، ورتبت الروايات والمسلسلات هيني",
      },
      {
        t: "p",
        c: "بحاول أخلصها هاد الأسبوع",
      },
      {
        t: "hr",
      },
      {
        t: "p",
        c: "اليوم الأحد، اشتغلت على قسم المسلسلات، لسا بمرحلة التخطيط، كلشي عالورق",
      },
      {
        t: "p",
        c: "حاس اني مش فاهم حاجة وفاهم كل حاجة بنفس الوقت",
      },
      {
        t: "hr",
      },
      {
        t: "p",
        c: "اليوم الاثنين، اليوم راح على الشغل بقسم المسلسلات",
      },
      {
        t: "p",
        c: "المهم كمان جربت شغلت السيرفر ووصلت اكتر من جهاز وكان بيتحمل",
      },
      {
        t: "p",
        c: "لسا ضايل اكمل شغل على المسلسلات والكتب",
      },
      {
        t: "p",
        c: "عندي فكرة لتزبيطهم",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "رييييلز",
      },
      {
        t: "p",
        c: "اليوم الثلاثاء، بدأت الشغل بالريلز بعد ماخلصت من الافلام والمسلسلات والكتب",
      },
      {
        t: "p",
        c: "هسوي انه يجيب ريل عشوائي بضغطة زر، بديل السحبة لفوق، صرت مجمع 200 ريل للآن، لسا اليوم بأوله",
      },
      {
        t: "h1",
        c: "شكل الموقع بعد 5 أيام شغل متواصل",
      },
      {
        t: "img",
        c: "https://i.imgur.com/yFhmEPj.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/qgY2lri.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/no7oOHu.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/DGRZiAl.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/fC5268G.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/HfGxuX1.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صور من الحياة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/3jmT69Q.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/bFBdMWc.jpeg",
      },
      {
        t: "p",
        c: "زينة أكلت لأول مرة",
      },
    ],
  },
  {
    id: 25,
    meta: {
      duration: "من 18 يونيو لـ 24 يونيو",
      year: 2025,
      summary: "PostgreSQL + Express.js",
    },
    events: [
      {
        type: "goals",
        goal: {
          t: "h1",
          c: "أهداف الأسبوع",
          g: [
            {
              name: "أستخدم SQL مع Express.js",
              isDone: true,
            },
            {
              name: "تغيير بالروتين اليومي",
              isDone: true,
            },
            {
              name: "رياضة كل يوم",
              isDone: true,
            },
          ],
        },
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "الأسبوع بدأ والنت فاصل",
      },
      {
        t: "p",
        c: "هي يوم الأربع والخميس والنت قاطع",
      },
      {
        t: "p",
        c: "بحاول ألاقي طريقة أكون فيها منتج بدون وجود النت",
      },
      {
        t: "p",
        c: "حاليا بقرأ كتب pdf منهم روايات ومنهم كتب مفيدة",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بدأت بقراءة كتاب Grokking Algorithms",
      },
      {
        t: "p",
        c: "الكتاب بيشرح أعقد موضوع بالبرمجة بأسلوب سهل ومبسط",
      },
      {
        t: "p",
        c: "بيستخدم الرسم والكتابة بخط اليد لتوضيح النقاط الصعبة",
      },
      {
        t: "p",
        c: "جدا حلو الكتاب",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Ramj4xx.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "حليت كمان سؤال برمجة",
      },
      {
        t: "p",
        c: "السؤال من سكشن التحضيرات لمقابلة الوظيفة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/z6EoXiS.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/pqKO8Bu.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بدأت أقرأ كتاب Eloquent JavaScript",
      },
      {
        t: "p",
        c: "اليوم السبت الساعة 6 ونص المسا، لسا النت مارجع، مقضيها بقرأ كتب",
      },
      {
        t: "p",
        c: "الكتاب هاد من أفضل كتب اللغة، قررت اني بقوي الاساسيات أكتر",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "النت رجع السبت الساعة 7 ونص",
      },
      {
        t: "p",
        c: "بستغل جيته تاني وبشوف شو كان ناقصني لما فصل",
      },
      {
        t: "p",
        c: "وبرضو بصير انتاجي اكبر بأضعاف بوجود النت",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بكمل بالكورس",
      },
      {
        t: "p",
        c: "مع رجعة النت بكمل في كورس express",
      },
      {
        t: "p",
        c: "ضايل آخر شغلة، استخدم قاعدة بيانات بالموقع",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صنعت أول مشروع فل-ستاك 😄",
      },
      {
        t: "p",
        c: "التقنيات المستخدمة",
      },
      {
        t: "p",
        c: "Express.js + PostgreSQL + EJS + CSS + HTML",
      },
      {
        t: "img",
        c: "https://i.imgur.com/x7RXk7x.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ZzynlHd.png",
      },
      {
        t: "h1",
        c: "READ",
      },
      {
        t: "img",
        c: "https://i.imgur.com/RaFUh2h.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/wOBY3vb.png",
      },
      {
        t: "h1",
        c: "CREATE",
      },
      {
        t: "img",
        c: "https://i.imgur.com/LeO9r3p.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ct0iCQO.png",
      },
      {
        t: "h1",
        c: "UPDATE",
      },
      {
        t: "img",
        c: "https://i.imgur.com/z9XRS8u.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/YoaUNZE.png",
      },
      {
        t: "h1",
        c: "DELETE",
      },
      {
        t: "img",
        c: "https://i.imgur.com/yW3JCaD.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/owjsTQN.png",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "الحرب العالمية الثالثة بدأت؟",
      },
      {
        t: "p",
        c: "امريكا ضربت إيران",
      },
      {
        c: "إيران بترد وبتضرب قواعد امريكية بالمنطقة، قطر، البحرين، الامارات، الكويت",
        t: "p",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "خلصت آخر مشروع لـExpress.js 💯",
      },
      {
        t: "a",
        c: "Source Code",
        l: "https://github.com/MohammedSIssa/node-sql-inventory-app",
      },
      {
        t: "a",
        c: "Live Preview",
        l: "https://node-sql-inventory-app.onrender.com/",
      },
      {
        t: "img",
        c: "https://i.imgur.com/r83lrA6.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/WkQDckf.png",
      },
      {
        t: "p",
        c: "قاعدة البيانات رفعتها على neon",
      },
      {
        t: "p",
        c: "وكود السيرفر رفعته على github وخليت موقع render يشغله ويقومه",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صور من الحياة",
      },
      {
        t: "p",
        c: "ألبوم زينة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/A6Fcnoq.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/saYGiBb.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/kKoNBUQ.jpeg",
      },
      {
        t: "p",
        c: "تزبيط الغدا (عدس لليوم الرابع على التوالي)",
      },
      {
        t: "img",
        c: "https://i.imgur.com/h0lZRxt.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بدأت بجزئية الـAuthentication بالمواقع",
      },
      {
        t: "p",
        c: "اليوم الثلاثاء آخر يوم بهالاسبوع، قلت بكمل بالكورس وكنت واصل لهالجزئية",
      },
      {
        t: "p",
        c: "الـAuthentication هي المسؤولية عن عمليات التحقق من المستخدمين على الموقع",
      },
      {
        t: "p",
        c: "وهي اللي بتتحكم بعمليات تسجيل الدخول والخروج عندي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/W1W0sPJ.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ygScwIu.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Y1oBVXQ.jpeg",
      },
      {
        t: "h1",
        c: "مفهمتش اشي 🙂",
      },
    ],
  },
  {
    id: 24,
    meta: {
      duration: "من 11 يونيو لـ 17 يونيو",
      year: 2025,
      summary: "خلصت كورس Express.js",
    },
    events: [
      {
        type: "goals",
        goal: {
          t: "h1",
          c: "أهداف الأسبوع",
          g: [
            {
              name: "أخلص كورس الـExpress.js",
              isFailed: true,
            },
            {
              name: "آخد كورسات برمجة",
              isDone: true,
            },
            {
              name: "تمارين رياضة كل يوم",
              isDone: true,
            },
          ],
        },
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "عملت أول مشروع بكورس express",
      },
      {
        t: "h3",
        c: "Mini Message Board",
      },
      {
        t: "img",
        c: "https://i.imgur.com/stZsBzG.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/AzUBLrY.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/PFCBgLu.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/U6TsdoD.png",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "فصل النت من يوم الخميس الصبح",
      },
      {
        t: "p",
        c: "مع فصلة النت قررنا بنغير في ديكور المكان، غيرنا مكان كل اشي",
      },
      {
        t: "p",
        c: "المطبخ وتقسيمة الغرف ومكان النوم",
      },
      {
        t: "p",
        c: "استغليت الفرصة واخدت غرفة لحالي",
      },
      {
        t: "h1",
        c: "قبل",
      },
      {
        t: "img",
        c: "https://i.imgur.com/g5As2QI.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/mhUWhIi.jpeg",
      },
      {
        t: "h1",
        c: "بعد",
      },
      {
        t: "p",
        c: "البني هو المكان تاعي هلقيت",
      },
      {
        t: "img",
        c: "https://i.imgur.com/d73qcBK.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/bZc8BCR.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "حليت سؤال برمجة",
      },
      {
        t: "p",
        c: "عشان كنت مجمع محتوى لفصلة النت من الاسبوع اللي فات، مع برنامج kiwix فما انقطعت عن محتوى أقرأه",
      },
      {
        t: "p",
        c: "حليت سؤال من سكشن التجهيز لمقابلات الوظيفة Coding Interview Prep Questions",
      },
      {
        t: "img",
        c: "https://i.imgur.com/5o4R93c.png",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/KJbbL93.png",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/EPPEn21.png",
        isLightImage: true,
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "رجع النت يوم السبت بعد صلاة العشا",
      },
      {
        t: "p",
        c: "تل أبيب انحرقت بهالليلة ❤️🔥",
      },
      {
        t: "img",
        c: "https://i.imgur.com/cv6y2OO.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "سويت مشروع express.js",
      },
      {
        t: "p",
        c: "طبقت فيه عمليات CRUD كلها، وهي",
      },
      {
        t: "p",
        c: "Create, Read, Update, Delete",
      },
      {
        t: "img",
        c: "https://i.imgur.com/CYUI2eX.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/P7Bumkr.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/UX5I2Xe.jpeg",
      },
    ],
  },
  {
    id: 23,
    meta: {
      duration: "من 4 ينويو لـ 10 يونيو",
      summary: "بداية Express.js",
      year: 2025,
    },
    events: [
      {
        t: "h1",
        c: "أهداف الأسبوع",
      },
      {
        t: "ul",
        c: [
          {
            title: "أبدأ بدورة Express.js",
            link: "#",
            isGoal: true,
            isDone: true,
          },
          {
            title: "كل يوم 200 Push-up",
            link: "#",
            isGoal: true,
            isDone: true,
          },
          {
            title: "مشاريع مشاريع مشاريع",
            link: "#",
            isGoal: true,
            isDone: true,
          },
        ],
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "جهزت احتياطاتي في حال صارت فصلة نت طويلة",
      },
      {
        t: "p",
        c: "لقيت برنامج اسمه kiwix بيخزن ملفات بصيغة ZIM وهدول الملفات انا بقدر بعدين افتحهم بدون نت عادي",
      },
      {
        t: "p",
        c: "يعني انا هلقيت نزلت ويكيبيديا، عشان اقدر اتعلم اشي بأي وقت بدي اياه",
      },
      {
        t: "p",
        c: "وكمان حجات تانية، صار المخزن حجمه 15 غيغا",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Qk7NphV.png",
        isTransparent: true,
        isLightImage: true,
      },
      {
        tag: "hr",
      },
      {
        t: "h1",
        c: "بديت بحل أسئلة Rosetta Code",
      },
      {
        t: "p",
        c: "مش عارف كم سؤال هحل، بس هحاول كل كام يوم أحل سؤال",
      },
      {
        t: "ul",
        c: [
          {
            title: "Rosetta Code",
            link: "https://www.freecodecamp.org/learn/rosetta-code/",
          },
        ],
      },
      {
        t: "img",
        c: "https://i.imgur.com/WRuXLtL.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/u2zJisp.png",
        isTransparent: true,
      },
      {
        t: "h3",
        c: "بعدين حليت سؤال الabc blocks وطلع معي 2 مش صح، مش عارف السبب",
      },
      {
        t: "p",
        c: "مش هغيره لأنه السؤال أصلا معقد",
      },
      {
        t: "img",
        c: "https://i.imgur.com/fgThXmT.png",
        size: "small",
      },
      {
        t: "img",
        c: "https://i.imgur.com/1HGlPHs.png",
        size: "small",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بدأت أتعلم Express.js",
      },
      {
        t: "img",
        c: "https://i.imgur.com/SzbIm0V.png",
        size: "small",
      },
      {
        t: "img",
        c: "https://i.imgur.com/NxtUzbw.jpeg",
        size: "small",
      },
      {
        t: "img",
        c: "https://i.imgur.com/2HC8nMK.jpeg",
        size: "small",
      },
      {
        t: "img",
        c: "https://i.imgur.com/08Oehyq.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/nIBHQqU.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/gX73zyX.jpeg",
        thumbnail: "https://i.imgur.com/qK3axYX.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صور من الحياة",
      },
      {
        t: "h3",
        c: "زينة 💞",
      },
      {
        t: "img",
        c: "https://i.imgur.com/iaeqDmT.jpeg",
        thumbnail: "https://i.imgur.com/11a6oa9.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/UAT3YUJ.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ZQFL9M6.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "العضلات اللي ركزت عليها هاد الأسبوع",
      },
      {
        t: "img",
        c: "https://i.imgur.com/8J5fORp.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/2faKIcj.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "الأشياء اللي تعلمتها هاد الأسبوع",
      },
      {
        t: "h3",
        c: "- Express.js -",
      },
      {
        t: "ul",
        c: [
          {
            title: "Introduction to Express.js",
            link: "https://www.theodinproject.com/lessons/node-path-nodejs-introduction-to-express",
          },
          {
            title: "Routes",
            link: "https://www.theodinproject.com/lessons/nodejs-routes",
          },
          {
            title: "Controllers",
            link: "https://www.theodinproject.com/lessons/nodejs-controllers",
          },
          {
            title: "Views",
            link: "https://www.theodinproject.com/lessons/nodejs-views",
          },
        ],
      },
      {
        t: "h1",
        c: "مقالات قرأتها",
      },
      {
        t: "ul",
        c: [
          {
            title: "Express Middlewares Demystified",
            link: "https://medium.com/@viral_shah/express-middlewares-demystified-f0c2c37ea6a1",
          },
          {
            title:
              "Learn MVC Pattern with ExpressJS and NodeJS - Tutorial Beginner",
            link: "https://www.youtube.com/watch?v=Cgvopu9zg8Y",
          },
        ],
      },
    ],
  },
  {
    id: 22,
    isSpecial: true,
    meta: {
      duration: "من 28 مايو لـ 3 يونيو",
      summary: "نقل الموقع لبيئة رياكت ⭐",
      year: 2025,
    },
    events: [
      {
        t: "h1",
        c: "أهداف الأسبوع",
      },
      {
        t: "ul",
        c: [
          {
            title: "إعادة برمجة الموقع بإستخدام رياكت ✅",
            link: "#",
          },
          {
            title: "تكملة على دورة Node.js ✅",
            link: "#",
          },
        ],
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "أكبر تغيير في تاريخ الموقع 😄🔥",
      },
      {
        t: "h3",
        c: "بعد يومين من الشغل المتواصل، تم تحويل الموقع من Vanilla Javascript إلى عالم React الفخم",
      },
      {
        t: "p",
        c: "الموقع صار الآن شغال باستخدام رياكت ومكاتب رياكت الرهيبة",
      },
      {
        t: "p",
        c: "وبإستخدام TailwindCSS بطلت محتاج أسوي ملف CSS منفصل لكل ستايل حجم شاشة مختلف",
      },
      {
        t: "p",
        c: "وبإستغلال JSX بطلت محتاج أخزن البيانات بطريقة معقدة وعرضها بطريقة أعقد، صار كل اشي أسرع وأسهل",
      },
      {
        t: "p",
        c: "ومع استخدام الـReact Router صار كل محتوى برابط خاص",
      },
      {
        t: "p",
        c: "وضفت أنميشن للتنقل بين الأسبابيع، وضفت صفحة واجهة",
      },
      {
        t: "p",
        c: "مع السلامة لـVanilla Javascript 🫡",
      },
      {
        t: "ul",
        c: [
          {
            title: "الموقع القديم (مابيتحدث)",
            link: "https://mohammedsissa.github.io/old-mohsaid99/",
          },
        ],
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "التكملة بكورس Node.js",
      },
      {
        t: "p",
        c: "تعملت كيف أساوي debug لتطبيقات نود، بمعنى انه افحص البرنامج من المشاكل من داخل vscode",
      },
      {
        t: "p",
        c: "طريقة جديدة، لكنها احسن من اني اضل اخمن من وين المشكلة واضيف مليون console.log عندي",
      },
      {
        t: "h1",
        c: "الروابط 👇🏻",
      },
      {
        t: "ul",
        c: [
          {
            title: "Debugging Node | The Odin Project",
            link: "https://www.theodinproject.com/lessons/nodejs-debugging-node",
          },
          {
            title: "Getting started with Node.js debugging in VS Code",
            link: "https://www.youtube.com/watch?v=2oFKNL7vYV8&ab_channel=VisualStudioCode",
          },
        ],
      },
      {
        c: "اخدت كورس W3Schools الخاص بجزئية Node.js",
        t: "h1",
      },
      {
        t: "ul",
        c: [
          {
            title: "W3Schools | Node.js",
            link: "https://www.w3schools.com/nodejs/default.asp",
          },
        ],
      },
      {
        t: "img",
        c: "https://i.imgur.com/YNhOMXs.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/yhV6ZS1.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "أحداث من الواقع",
      },
      {
        t: "p",
        c: "المساعدات بدأت تفوت لكن كلها بتنسرق، حتى السواقين بيقفو وبيسمحو للسرقات تصير!",
      },
      {
        t: "p",
        c: "خلص الطحين من البيت",
      },
      {
        t: "p",
        c: "كيلو الطحين ب100 شيكل",
      },
      {
        t: "p",
        c: "كيس الطحين ب2000 شيكل!",
      },
      {
        t: "p",
        c: "كيلو السكر ب200 شيكل",
      },
      {
        t: "p",
        c: "فش خضار، فش فاكهة، فش خبز، فش فلوس، بناكل بالمعلقة صرنا، الأكل عبارة عن رز وعدس",
      },
      {
        t: "p",
        c: "الحمدلله على كل حال",
      },
      {
        t: "p",
        c: "اخلاءات على الساعة 12 بنص الليل!",
      },
      {
        t: "p",
        c: "أعطيت الحصة الرابعة لتلميذي في HTML",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صور من الحياة",
      },
      {
        t: "p",
        c: "آخر رغيف خبر هاكله هاد الأسبوع",
      },
      {
        t: "img",
        c: "https://i.imgur.com/5drzwt9.jpeg",
        thumbnail: "https://i.imgur.com/wDY9Ae0.jpeg",
      },
      {
        t: "p",
        c: "حبيبة عمو أم عيون حلوة 🥹 زينة صارت 10 أسابيع ❤️",
      },
      {
        t: "img",
        c: "https://i.imgur.com/1sqXFFI.jpeg",
        thumbnail: "https://i.imgur.com/QKIeRXN.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/qCPRnnO.jpeg",
        thumbnail: "https://i.imgur.com/J9rBGBK.jpeg",
      },
      {
        t: "h2",
        c: "شاي بالحليب ♨️",
      },
      {
        t: "p",
        c: "عشان مافي سكر، بكثر كمية الحليب وبيطلع فيه طعم حلو",
      },
      {
        t: "img",
        c: "https://i.imgur.com/PhiKdr3.jpeg",
        thumbnail: "https://i.imgur.com/BsGoGKR.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ZWqkOZ6.jpeg",
        thumbnail: "https://i.imgur.com/eqozOuj.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/I3jVObJ.jpeg",
        thumbnail: "https://i.imgur.com/fbwmrsf.jpeg",
      },
    ],
  },
  {
    id: 21,
    meta: {
      duration: "من 21 مايو لـ 27 مايو",
      summary: "مقدمة في عالم الـbackend",
      year: 2025,
    },
    events: [
      {
        t: "h1",
        c: "أهداف الأسبوع",
      },
      {
        t: "ul",
        c: [
          {
            title: "أتعمق في SQL",
            link: "#",
          },
          {
            title: "أبدأ دورة Node.js",
            link: "#",
          },
          {
            title: "أعمل مشاريع بالرياكت",
            link: "#",
          },
        ],
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "كورس الأسبوع",
      },
      {
        t: "p",
        c: "بعمل موقع 3D باستخدام الرياكت ومكاتبها الرهيبة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/YM8MIor.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "التعمق في SQL",
      },
      {
        t: "p",
        c: "لقيت موقع بيعلم على شكل حل قضايا شرطة وإجرام يعني",
      },
      {
        t: "ul",
        c: [
          {
            title: "SQLPD.com",
            link: "https://sqlpd.com/",
          },
        ],
      },
      {
        t: "img",
        c: "https://i.imgur.com/3nCREMk.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/RgnYA1K.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ji7CALZ.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/yUdoC26.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بداية كورس Node.js",
      },
      {
        t: "img",
        c: "https://i.imgur.com/JmoDPSm.png",
      },
      {
        t: "h1",
        c: "صنعت أول سيرفر",
      },
      {
        t: "img",
        c: "https://i.imgur.com/V42gspi.png",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "حضرت كورس ساعتين خفيف",
      },
      {
        t: "img",
        c: "https://i.imgur.com/uC3Tusy.jpeg",
      },
      {
        t: "h1",
        c: "صنعت أول API",
      },
      {
        t: "img",
        c: "https://i.imgur.com/HtTpth3.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/nck8Hhb.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/bjwfIRk.png",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "الأشياء اللي تعلمتها خلال الأسبوع",
      },
      {
        t: "p",
        c: "- Node.js -",
      },
      {
        t: "ul",
        c: [
          {
            title: "Introduction to Node.js",
            link: "https://www.theodinproject.com/lessons/nodejs-introduction-what-is-nodejs",
          },
          {
            title: "About Node.js",
            link: "https://nodejs.org/en/about/",
          },
        ],
      },
      {
        t: "p",
        c: "- Articles I read -",
      },
      {
        t: "ul",
        c: [
          {
            title: "Blocking vs. Non-Blocking Events",
            link: "https://nodejs.org/en/learn/asynchronous-work/overview-of-blocking-vs-non-blocking",
          },
          {
            title: "Understandnig Callbacks",
            link: "https://dev.to/i3uckwheat/understanding-callbacks-2o9e",
          },
          {
            title: "Introduction to the server side",
            link: "https://developer.mozilla.org/en-US/docs/Learn_web_development/Extensions/Server-side/First_steps/Introduction",
          },
          {
            title: "Client-server overview",
            link: "https://developer.mozilla.org/en-US/docs/Learn_web_development/Extensions/Server-side/First_steps/Client-Server_overview",
          },
          {
            title: "Making network requests with JavaScript",
            link: "https://developer.mozilla.org/en-US/docs/Learn_web_development/Extensions/Server-side/First_steps/Client-Server_overview",
          },
          {
            title: "Making HTTP requests with Node.js",
            link: "https://github.com/nodejs/nodejs.dev/blob/aa4239e87a5adc992fdb709c20aebb5f6da77f86/content/learn/node-js-web-server/node-make-http-requests.en.md",
          },
        ],
      },
    ],
  },
  {
    id: 20,
    meta: {
      duration: "من 14 مايو لـ 20 مايو",
      summary: "كورس قواعد البيانات SQL",
      year: 2025,
    },
    events: [
      {
        t: "h1",
        c: "بدأت بكورس قواعد البيانات",
      },
      {
        t: "p",
        c: "بهالكورس رح أركز على PostgreSQL",
      },
      {
        t: "img",
        c: "https://i.imgur.com/wdBdyYG.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "الكورس كان خفيف من على الموقع الرسمي، كان أغلبه روابط وفيديوهات",
      },
      {
        t: "img",
        c: "https://i.imgur.com/i9FQa2v.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/vqYztgn.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/R2xfOHU.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/mkZhjNy.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/VHIqqVj.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ne40DOu.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "خلصت الكورس",
      },
      {
        t: "p",
        c: "طبعا محتاج أتعمق أكتر لسا",
      },
      {
        t: "img",
        c: "https://i.imgur.com/M6VOTX5.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "أحداث من الواقع",
      },
      {
        t: "p",
        c: "18/05/2025",
      },
      {
        t: "img",
        c: "https://i.imgur.com/nOuvl9X.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/77baW67.png",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صور من الحياة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/YKzZzux.jpeg",
        isLightImage: true,
      },
      {
        t: "p",
        c: "صرنا نوزع الخبز بالعد على بعض",
      },
      {
        t: "p",
        c: "بيطلعي 4 أرغف كل يومين",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Zsbw3HT.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/NDuilUY.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/X5W6Clu.jpeg",
      },
      {
        t: "p",
        c: "زينة وهي مبسوطة 💞",
      },
      {
        t: "img",
        c: "https://i.imgur.com/euBXvXG.jpeg",
      },
    ],
  },
  {
    id: 19,
    meta: {
      duration: "من 7 مايو لـ 13 مايو",
      summary: "كورس MERN ستاك",
      year: 2025,
    },
    events: [
      {
        t: "h1",
        c: "كورس الأسبوع",
      },
      {
        t: "img",
        c: "https://i.imgur.com/OXQrKV0.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "جزئية الـBackend",
      },
      {
        t: "p",
        c: "Express + MongoDB + Postman",
      },
      {
        t: "img",
        c: "https://i.imgur.com/yUCPsMm.jpeg",
      },
      {
        t: "h1",
        c: "GET /api/products",
      },
      {
        t: "img",
        c: "https://i.imgur.com/1MXvExC.jpeg",
      },
      {
        t: "h1",
        c: "DELETE /api/products/:id",
      },
      {
        t: "img",
        c: "https://i.imgur.com/U4CTAFS.jpeg",
      },
      {
        t: "h1",
        c: "PUT /api/products/:id",
      },
      {
        t: "img",
        c: "https://i.imgur.com/UnJfQcW.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "هيكلية الملفات",
      },
      {
        t: "img",
        c: "https://i.imgur.com/proFQF0.png",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "جزئية الـFrontend",
      },
      {
        t: "p",
        c: "React + TailwindCSS + Toastify",
      },
      {
        t: "h1",
        c: "بنيت صفحة واجهة لإضافة المنتجات",
      },
      {
        t: "img",
        c: "https://i.imgur.com/5YlBZyd.jpeg",
        isLightImage: true,
      },
      {
        t: "p",
        c: "تم إضافة المنتج",
      },
      {
        t: "img",
        c: "https://i.imgur.com/DOdWiZk.jpeg",
      },
      {
        t: "h1",
        c: "تنزيل وتزبيط مكتبة react-toastify",
      },
      {
        t: "img",
        c: "https://i.imgur.com/I13neV5.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/5EBWoWO.jpeg",
      },
      {
        t: "h1",
        c: "تم تزبيط الاشعارات",
      },
      {
        t: "img",
        c: "https://i.imgur.com/kFSMvxB.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/5r5nk2R.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/He55Dvt.png",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "المشروع جهز",
      },
      {
        t: "img",
        c: "https://i.imgur.com/jrFD1lx.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/mYK30CL.jpeg",
      },
    ],
  },
  {
    id: 18,
    meta: {
      duration: "من 30 أبريل لـ 6 مايو",
      summary: "مشاريع بالرياكت",
      year: 2025,
    },
    events: [
      {
        t: "h1",
        c: "Landing Page 2",
      },
      {
        t: "img",
        c: "https://i.imgur.com/bBkK4lm.jpeg",
        size: "long",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "Landing Page 3",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Yc4aBza.jpeg",
        size: "long",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بتعلم في TailwindCSS",
      },
      {
        t: "p",
        c: "ياهلا بالسرعة في التصميم، مع دعم كل أحجام الأجهزة",
      },
      {
        t: "h1",
        c: "Landing Page 4",
      },
      {
        t: "p",
        c: "صنعت بمساعدة TailwindCSS",
      },
      {
        t: "ul",
        c: [
          {
            title: "عرض الموقع 👀",
            link: "https://mohammedsissa.github.io/landing-page-5/",
          },
        ],
      },
      {
        t: "img",
        c: "https://i.imgur.com/UPjr0DH.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/SnRplqY.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/bNSyoX7.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/m6ctVKO.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بديت بالشغل في موقع لأبوي",
      },
      {
        t: "p",
        c: "هيكون موقع لتعليم الفيزياء لكل المراحل",
      },
      {
        t: "img",
        c: "https://i.imgur.com/f543xUZ.png",
      },
      {
        t: "hr",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ySrDUxL.png",
      },
    ],
  },
  {
    id: 17,
    isSpecial: true,
    meta: {
      duration: "من 23 أبريل لـ 29 أبريل",
      summary: "أنهيت كورس الرياكت",
      year: 2025,
    },
    events: [
      {
        t: "h1",
        c: "أنهيت كورس الرياكت 🎇",
      },
      {
        t: "img",
        c: "https://i.imgur.com/4FBo6q4.jpg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/gi27liP.png",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "مشروع: نسخة من موقع react.dev",
      },
      {
        t: "p",
        c: "ممارسة للي تعلمته، مش كلشي شغال طبعا",
      },
      {
        t: "img",
        c: "https://i.imgur.com/dCqqqVi.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ZlHsRCF.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/EJV9w6R.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/fXuLe3C.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/wVLjuC9.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/evi6qcu.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/b06zckB.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/cauXJrO.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/0Q14Jdb.png",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "عملت حساب upwork",
      },
      {
        t: "p",
        c: "هلقيت لازم أعمل portfolio يعجب الزبون حتى أشتغل",
      },
      {
        t: "p",
        c: "هبدأ في عمل landing pages لانه عليهم طلب",
      },
      {
        t: "p",
        c: "تحويل تصميم صورة إلى كود رياكت",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "Landing Page 1",
      },
      {
        t: "img",
        c: "https://i.imgur.com/l9SIBO0.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/XG0XVH7.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/Amxscla.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/O8NbEd6.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/jllFDlj.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/3LdGAR1.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/dHFDqRs.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/q3Wued5.jpeg",
        isLightImage: true,
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صور من الحياة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/kU6D7Qc.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/nKifJzz.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/pDaC5DV.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "الأشياء اللي تعلمتها خلال الأسبوع",
      },
      {
        t: "p",
        c: "- Memoization -",
      },
      {
        t: "ul",
        c: [
          {
            title: "The Odin Project Lesson",
            link: "https://www.theodinproject.com/lessons/node-path-react-new-refs-and-memoization#the-usememo-hook",
          },
        ],
      },
      {
        t: "p",
        c: "- useRef -",
      },
      {
        t: "ul",
        c: [
          {
            title: "react.dev",
            link: "https://react.dev/learn/referencing-values-with-refs",
          },
          {
            title: "The Odin Project Lesson",
            link: "https://www.theodinproject.com/lessons/node-path-react-new-refs-and-memoization#the-useref-hook",
          },
        ],
      },
      {
        t: "p",
        c: "- Articles I read -",
      },
      {
        t: "ul",
        c: [
          {
            title: "Manipulating the DOM with Refs",
            link: "https://react.dev/learn/manipulating-the-dom-with-refs",
          },
        ],
      },
      {
        t: "hr",
      },
      {
        t: "img",
        c: "https://i.imgur.com/NwiWlf5.png",
      },
    ],
  },
  {
    id: 16,
    meta: {
      duration: "من 16 أبريل لـ 22 أبريل",
      summary: "مشروع رياكت الثالث",
      year: 2025,
    },
    events: [
      {
        t: "h1",
        c: "Fetching Data in React",
      },
      {
        t: "img",
        c: "https://i.imgur.com/hGxKEJb.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Squy6Lc.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "إنجاز جديد: خلصت أخر مشروع بكورس الرياكت 🎉⚡",
      },
      {
        t: "h3",
        c: "Shopping Cart | سلة تسوق 🛒",
      },
      {
        t: "ul",
        c: [
          {
            title: "عرض الموقع 👀",
            link: "https://mohammedsissa.github.io/shopping-cart/",
          },
          {
            title: "عرض الكود 🔎",
            link: "https://github.com/MohammedSIssa/shopping-card-react-code",
          },
        ],
      },
      {
        t: "h3",
        c: "Tech Stack: React + CSS",
      },
      {
        t: "img",
        c: "https://i.imgur.com/7dFn8R9.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/oFbq0hZ.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/hFMMjXI.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/ubsal6j.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/pso7wxS.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/STDqaUD.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "تعملت كيف أستخدم useContext في رياكت",
      },
      {
        t: "h3",
        c: "بشرحه عالسريع",
      },
      {
        t: "p",
        c: "هلقيت عندي بمشروع الرياكت غالبا بيبقى في بيانات بدي اوصلها من (الجد) للحفيد، بس الطريق في النص بيبقى عندي (أب) و (ابن) وكلهم لازم يمررو المعلومات حتى توصل للحفيد، هاد بنسميه بالرياكت (prop drilling ) يعني بمرر البيانات من اب لابن لابن لابن الخ، هان بييجي الuseContext زي خط التلفون مباشرة من الجد للحفيد بدون م تمر كل العيلة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/fHYjAKh.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/w1S7Z3f.png",
      },
      {
        t: "h1",
        c: "وكمان تعلمت useReducer",
      },
      {
        t: "h3",
        c: "برضو بشرحه",
      },
      {
        t: "p",
        c: "لو عندك state معقد شوي، مثلا تطبيق ToDo أو Shopping Cart وصار عندك كتير اكشنز زي (إضافة، حدف، تعديل، الخ) لو هستخدم useState لحالها هدوخ، وهان بييجي الuseReducer وبتشتغل زي عقل صغير بيستقبل أوامر وبيقرر شو يعمل",
      },
      {
        t: "h3",
        c: "الها مكونين اتنين، الأول function reducer",
      },
      {
        t: "img",
        c: "https://i.imgur.com/njULWrC.jpeg",
      },
      {
        t: "p",
        c: "بتستقبل state الحالي و action وبترجع state جديدة حسب ال type تاع ال action",
      },
      {
        t: "h3",
        c: "المكون الثاني: useReducer",
      },
      {
        t: "img",
        c: "https://i.imgur.com/LElVtx8.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "استخدام useContext & useReducer مع بعض",
      },
      {
        t: "p",
        c: "لو عندك برنامج كبير، بتستخدم ال useReducer عشان اجمع منطق تحديث البيانات، وبغلفه جوات useContext عشان اوزع ال state وال dispatch على باقي المكونات",
      },
      {
        t: "h3",
        c: "مشروع عالسريع",
      },
      {
        t: "img",
        c: "https://i.imgur.com/1cMUDPe.png",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/mkw2SSU.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/UUVLcp1.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/JgAvRGb.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/fOoKrp1.png",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صور من الحياة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/TpMfDmJ.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/HXTJjhy.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Xgqg8im.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/SkAdsGj.jpg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/2vQAVoA.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/IuBhYf0.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/q8YcoX0.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "أسعار السوق 🛒🔥",
      },
      {
        t: "p",
        c: "راس البصل ب 7 شيكل (2 دولار) وفش فواكه بالسوق، فش غير بسكوت الشاي والحبة ب5 شيكل، كيلو البندورة 20 شيكل، فش غير فلفل اخضر وخيار بالسوق",
      },
      {
        t: "h3",
        c: "الوضع مع قمر بستي",
      },
      {
        t: "p",
        c: "وصلت اخر 6 علب لحمة، وضايل جبنة متلتات، بديت اقلق 😄",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "الأشياء اللي تعلمت عنها الأسبوع هاد",
      },
      {
        t: "p",
        c: " - Fetching Data in React - ",
      },
      {
        t: "ul",
        c: [
          {
            title: "The Odin Project Lesson",
            link: "https://www.theodinproject.com/lessons/node-path-react-new-styling-react-applications",
          },
          {
            title: "Modern API data-fetching methods in React",
            link: "https://blog.logrocket.com/modern-api-data-fetching-methods-react/",
          },
          {
            title: "How to fetch data in React with performance in mind",
            link: "https://www.developerway.com/posts/how-to-fetch-data-in-react",
          },
        ],
      },
      {
        t: "p",
        c: "مكتبات تصميم جاهزة للرياكت",
      },
      {
        t: "ul",
        c: [
          {
            title: "CSS in JS",
            link: "https://styled-components.com/",
          },
          {
            title: "TailwindCSS",
            link: "https://tailwindcss.com/",
          },
          {
            title: "Chakra UI",
            link: "https://chakra-ui.com/",
          },
          {
            title: "Radix UI",
            link: "https://www.radix-ui.com/",
          },
          {
            title: "lucide-react",
            link: "https://lucide.dev/guide/packages/lucide-react",
          },
          {
            title: "react-icons",
            link: "https://react-icons.github.io/react-icons/",
          },
        ],
      },
      {
        t: "p",
        c: "- Articles I read -",
      },
      {
        t: "ul",
        c: [
          {
            title: "Understanding CORS",
            link: "https://rbika.com/blog/understanding-cors",
          },
          {
            title:
              "The mystery of React Elements, children, parents, and re-renders",
            link: "https://www.developerway.com/posts/react-elements-children-parents",
          },
          {
            title: "How to solve requests waterfall",
            link: "https://www.developerway.com/posts/how-to-fetch-data-in-react#part7",
          },
          {
            title: "How to Style React Components Using CSS Modules",
            link: "https://www.makeuseof.com/react-components-css-modules-style/",
          },
          {
            title: "React Component Composition",
            link: "https://www.robinwieruch.de/react-component-composition/",
          },
        ],
      },
      {
        t: "p",
        c: "- Context API -",
      },
      {
        t: "ul",
        c: [
          {
            title: "The Odin Project Lesson",
            link: "https://www.theodinproject.com/lessons/node-path-react-new-managing-state-with-the-context-api#implementing-context-api",
          },
          {
            title: "React.dev Docs",
            link: "https://react.dev/reference/react/useContext",
          },
          {
            title: "React.dev Examples",
            link: "https://react.dev/learn/passing-data-deeply-with-context",
          },
        ],
      },
      {
        t: "p",
        c: "- useReducer -",
      },
      {
        t: "ul",
        c: [
          {
            title: "The Odin Project Lesson",
            link: "https://www.theodinproject.com/lessons/node-path-react-new-reducing-state",
          },
          {
            title: "React.dev Docs",
            link: "https://react.dev/learn/extracting-state-logic-into-a-reducer",
          },
          {
            title: "The React useReducer Hook",
            link: "https://www.telerik.com/blogs/react-usereducer-hook",
          },
        ],
      },
      {
        t: "hr",
      },
      {
        t: "img",
        c: "https://i.imgur.com/clknE8q.png",
      },
    ],
  },
  {
    id: 15,
    meta: {
      duration: "من 9 أبريل لـ 15 أبريل",
      summary: "رياكت متقدم",
      year: 2025,
    },
    events: [
      {
        t: "h1",
        c: "مقدمة في اختبار الرياكت",
      },
      {
        t: "p",
        c: "Vitest, React Testing Library (RTL)",
      },
      {
        t: "img",
        c: "https://i.imgur.com/foXHyqC.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/amNEMd9.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/C3OAmq8.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/4lBBUsH.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/hBo3aDr.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/VZzCwE6.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/3DXiXO2.png",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "React Router",
      },
      {
        t: "img",
        c: "https://i.imgur.com/eJqqQUr.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/uSHly7p.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/npyWyBJ.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/4aXjLBw.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/lA1Gsye.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/cCQxjzQ.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صور من الحياة  📷",
      },
      {
        t: "img",
        c: "https://i.imgur.com/zyAERvZ.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/uKeNppH.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/cUQjCun.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/GD1re2X.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/QSNikaC.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "في هاد الأسبوع تعلمت عن",
      },
      {
        t: "ul",
        c: [
          {
            title: "React Testing Library",
            link: "#",
          },
          {
            title: "Vitest",
            link: "#",
          },
          {
            title: "Jest DOM",
            link: "#",
          },
          {
            title: "Screen, Render, user-event",
            link: "#",
          },
          {
            title: "Prototypal Inheritance",
            link: "#",
          },
          {
            title: "PropTypes",
            link: "#",
          },
          {
            title: "defaultProps",
            link: "#",
          },
          {
            title: "History API",
            link: "#",
          },
          {
            title: "Single Page Applications (SPA)",
            link: "#",
          },
          {
            title: "React Router",
            link: "#",
          },
        ],
      },
      {
        t: "hr",
      },
      {
        t: "img",
        c: "https://i.imgur.com/bOFhjfi.jpeg",
      },
    ],
  },
  {
    id: 14,
    meta: {
      duration: "من 2 أبريل لـ 8 أبريل",
      summary: "مشروع رياكت الثاني",
      year: 2025,
    },
    events: [
      {
        t: "h1",
        c: "مشروع رياكت الثاني: Memory Cards",
      },
      {
        t: "img",
        c: "https://i.imgur.com/uHRNwfA.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Np5cBaD.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/yj4jEcN.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/AlbULB3.png",
      },
      {
        t: "p",
        c: "بديت أتطور بالرياكت 🤓",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "سويت ناموسية بعوض 🦟🚫",
      },
      {
        t: "img",
        c: "https://i.imgur.com/GiEQv2H.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "ستريك Duolingo وصل 221 يوم  😤",
      },
      {
        t: "img",
        size: "extra-small",
        c: "https://i.imgur.com/IS13XVv.png",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "أحداث من الواقع",
      },
      {
        t: "h3",
        c: "إحتلال رفح",
      },
      {
        t: "p",
        c: "اليوم منطقة فيلادلفيا ب انعملت، في موراج، كل رفح راحت",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "صور من الحياة 📷",
      },
      {
        t: "img",
        c: "https://i.imgur.com/HQFX6Ys.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/IvlJeZC.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/0kOugos.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/d6rTRn1.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/8OrSrZ6.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "الحجات اللي تعملتها الأسبوع هاد",
      },
      {
        t: "ul",
        c: [
          {
            title: "JSX",
            link: "#",
          },
          {
            title: "States in React",
            link: "#",
          },
          {
            title: "Props",
            link: "#",
          },
          {
            title: "useEffect, useState",
            link: "#",
          },
          {
            title: "React Class Components",
            link: "#",
          },
          {
            title: "Clothes in Hebrew",
            link: "#",
          },
        ],
      },
      {
        t: "hr",
      },
      {
        t: "img",
        c: "https://i.imgur.com/cEdqDjy.jpeg",
      },
    ],
  },
  {
    id: 13,
    meta: {
      duration: "من 26 مارس لـ 1 أبريل",
      summary: "أول مشروع في الرياكت",
      year: 2025,
    },
    events: [
      {
        t: "h1",
        c: "المشروع الأول بالرياكت: CV Application",
      },
      {
        t: "img",
        c: "https://i.imgur.com/s4nyv7H.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Qzcivzh.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "شغل بالبيت",
      },
      {
        t: "p",
        c: "عملت شبكة الليدات، صار بكل غرفة ليد مع مفتاحه",
      },
    ],
  },
  {
    id: 12,
    meta: {
      duration: "من 19 مارس لـ 25 مارس",
      summary: "رجعت الحرب",
      year: 2025,
    },
    events: [
      {
        t: "h1",
        c: "تغيير في السيت أب",
      },
      {
        t: "p",
        c: "عدت ترتيب غرفتي خصوصا مع الأغراض الجديدة اللي جبتهم معي من غزة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/RAxAFW3.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/I5sIkmC.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "رجعت الحرب",
      },
      {
        t: "p",
        c: "للأسف الهدنة ماكانت غير بريك من المجازر، الظروف صعبة، الحمدلله على كل شيء",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "جوالي خرب تاني",
      },
      {
        t: "p",
        c: "مع الكهرب طبعا، كل اشي تقريبا قاعد بيخرب مع الواحد، حتى مخه",
      },
      {
        t: "img",
        c: "https://i.imgur.com/BSySora.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "تغيير بشكل الموقع على الشاشات الكبيرة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/6mEvjOT.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "أول خطوات بالرياكت",
      },
      {
        t: "img",
        c: "https://i.imgur.com/mhZM3tM.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/FJgQD9S.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ykIOwL6.png",
      },
      {
        t: "hr",
      },
      {
        t: "img",
        c: "https://i.imgur.com/STn9bib.jpeg",
      },
    ],
  },
  {
    id: 11,
    isSpecial: true,
    meta: {
      duration: "من 12 مارس لـ 18 مارس",
      summary: "صرت عم، بديت بالرياكت، مشوار غزة الثالث",
      year: 2025,
    },
    events: [
      {
        t: "h1",
        c: "تعديلات بسيطة على الموقع",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Twdx7oB.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/3MH6zcZ.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/drQY1pY.png",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بتاريخ 12 مارس الساعة 4 ونص الفجر",
      },
      {
        t: "p",
        c: "صرت عمو 🤗 مرحبا زينة 💞",
      },
      {
        t: "img",
        c: "https://i.imgur.com/veWwRQj.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "تحديث جديد: Lazy Loading 🦥",
      },
      {
        t: "p",
        c: "يعني ببساطة إنك ما بتجيب كل البيانات أو الصور مرة وحدة لما تفتح الموقع، لا.. بتخلي الحاجات تنزل بس لما تحتاجها، يعني لما توصللها وأنت بتتصفح",
      },
      {
        t: "p",
        c: "بدل ما أحمل كل الداتا دفعة وحدة، خليت البيانات تنزل بس لما أوصللها بالموقع، وهيك صار الموقع اسرع واخف 💯",
      },
      {
        t: "p",
        c: "صورة الكود عشان ما أنساه 🤓",
      },
      {
        t: "img",
        c: "https://i.imgur.com/QASpXyV.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "عملت تصميم لبور بانك لابتوب، بيجي يوم أسويه 🙂",
      },
      {
        t: "img",
        c: "https://i.imgur.com/YDEichW.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "إنجاز جديد: خلصت الكورس الثالث في دورة Full-Stack 💫",
      },
      {
        t: "img",
        c: "https://i.imgur.com/WSNANmX.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/WkiEpbG.jpeg",
      },
      {
        t: "h1",
        c: "المشروع الأخير: صفحة بورتفوليو تستجيب لكل أحجام الشاشات",
      },
      {
        t: "iframe",
        videoId: "-d3HiNIH1gU",
        type: "desktop",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "17/3/2025 الساعة 6 صباحا",
      },
      {
        t: "h3",
        c: "مشوار غزة الثالث",
      },
      {
        t: "p",
        c: "الهدف من الطلعة: نجيب أغراض من البيت في غزة",
      },
      {
        t: "p",
        c: "*كل أغراضنا في غزة، احنا نزحنا بدون اشي*",
      },
      {
        t: "h3",
        c: "بديت أوثق من الساعة 6:49 واحنا ماشيين باتجاه شارع الرشيد",
      },
      {
        t: "img",
        c: "https://i.imgur.com/KSzlTAY.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/zV43hRF.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/tCzGVr1.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/zeWYIi7.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/SxhRzx3.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/IRwunkL.jpeg",
        isLightImage: true,
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "ركبنا تكتك لعند تلة النويري",
      },
      {
        t: "img",
        c: "https://i.imgur.com/TnPMZ5C.jpeg",
        isLightImage: true,
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "نزلنا عند تلة النويري، وركبنا تكتك تاني لعند دوار النابلسي بغزة",
      },
      {
        t: "p",
        c: "مشينا من دوار النابلسي للبيت، بمفترق المغربي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/9iMKfvx.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/YlOzHNv.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/AeXkIp9.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/zmlJEko.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/gn84Psg.jpeg",
        isLightImage: true,
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "وصلنا البيت الساعة 8:45AM",
      },
      {
        t: "img",
        c: "https://i.imgur.com/9sILJHr.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/sDuPRr1.jpeg",
        isLightImage: true,
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "بنبلش شغل ولملمة الغراض اللازمة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/wHo6jC3.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/uQKgmwY.jpeg",
        isLightImage: true,
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "لقينا صورة لدارنا بالشوكة 🥲",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Koz8ckV.jpeg",
        isLightImage: true,
      },
      {
        t: "h1",
        c: "After AI",
      },
      {
        t: "img",
        c: "https://i.imgur.com/SORSDnw.jpeg",
        thumbnail: "https://i.imgur.com/RV2fiKl.jpeg",
        isLightImage: true,
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "خلصنا نقل على كارة بموعد أذان الظهر",
      },
      {
        t: "img",
        c: "https://i.imgur.com/PcICLSx.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: " تحركت انا وابوي على شقة اختي ايمان",
      },
      {
        t: "img",
        isLightImage: true,
        c: "https://i.imgur.com/KyqNKU5.jpeg",
      },
      {
        t: "img",
        isLightImage: true,
        c: "https://i.imgur.com/Tw1mlqn.jpeg",
      },
      {
        t: "img",
        isLightImage: true,
        c: "https://i.imgur.com/7toUl50.jpeg",
      },
      {
        t: "img",
        isLightImage: true,
        c: "https://i.imgur.com/vKBjLcm.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "اسبوع فاصل نت أغلبه",
      },
      {
        t: "img",
        c: "https://i.imgur.com/IiQfxn8.jpeg",
        isLightImage: true,
      },
      {
        t: "hr",
      },
      {
        t: "img",
        c: "https://i.imgur.com/jT1aqwW.jpeg",
      },
    ],
  },
  {
    id: 10,
    isSpecial: true,
    meta: {
      duration: "من 5 مارس لـ 11 مارس",
      summary: "إضافات كبيرة للموقع ⭐",
      year: 2025,
    },
    events: [
      {
        t: "h1",
        c: "تحديث جديد: مرحبا بالإيمجويات 🙂🔥",
      },
      {
        t: "p",
        c: "غيرت كل الكلام، قبل كان جاف شوي، ومع ✨ الإيموجيات ✨ صار في روح وحياة بالموقع بدل الجو الرسمي 😄",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "تحديث على الصور",
      },
      {
        t: "p",
        c: "خليت الصورة كلها تبقى ظاهرة، يعني دايما طول الصورة أصغر من طول الشاشة",
      },
      {
        t: "h1",
        c: "قبل 👇🏻",
      },
      {
        t: "img",
        c: "https://i.imgur.com/VLnejBf.jpeg",
      },
      {
        t: "h1",
        c: "بعد 👇🏻",
      },
      {
        t: "img",
        c: "https://i.imgur.com/iZWj8OM.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "تحديث جديد: إعادة برمجة الموقع من الصفر ✨",
      },
      {
        t: "p",
        c: "غيرت طريقة تخزين البيانات، كنت محتاج أستغني عن استخدام سكريبتات خارجية، كنت محتاج طريقة أسهل لإضافة التحديثات كل مرة",
      },
      {
        t: "h1",
        c: "الطريقة القديمة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/U55XqtK.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/C3xjf9n.jpeg",
      },
      {
        t: "h1",
        c: "الطريقة الجديدة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/q9YTLk7.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/PTYE8bK.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/40ZRyfn.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "تحديث جديد: تغيير ستايل الموقع",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ajj81FN.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/U3NBAN8.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "img",
        c: "https://i.imgur.com/d1z5WUt.jpeg",
      },
    ],
  },
  {
    id: 9,
    meta: {
      duration: "من 26 فبراير لـ 4 مارس",
      summary: "إضافة الرسمة على الموقع",
      year: 2025,
    },
    events: [
      {
        t: "h1",
        c: "برمجت رسمة بتوثق وقت التعلم لكل يوم في الأسبوع",
      },
      {
        t: "p",
        c: "هالرسمة بتخليني أسجل قديش تعلمت بكل يوم",
      },
      {
        t: "img",
        c: "https://i.imgur.com/jGAr4gf.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ipnctsO.png",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "حليت سؤال 23 من Project Euler",
      },
      {
        t: "p",
        c: "السؤال كان عبارة عن ايجاد مجموع الأعداد التي تعتبر ليست جمع لعددين حاصل مجموع عواملهم اكبر منهم",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ZLxeGL0.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/LgsSBoe.png",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "غيرت cdn الصور",
      },
      {
        t: "p",
        c: "كنت أرفع الصور على الانستا، بعد هيك أنسخ الرابط تاعهم وأضيفه هان",
      },
      {
        t: "p",
        c: "بس اكتشفت انه الإنستا بيغير روابط الصور كل شهر، صار مشاكل والصور بطلت تظهر",
      },
      {
        t: "p",
        c: "يعني كل شهر بدي احدث روابط الصور كلها!",
      },
      {
        t: "p",
        c: "لقيت موقع اسمه imgur بيعطي روابط ثابتة",
      },
      {
        t: "h1",
        c: "وكمان عملت تحسينات على الصور",
      },
      {
        t: "p",
        c: "غيرت صيغة الصور من png ل jpg، حجم الصور صار أقل بنسبة 90 بالمية",
      },
      {
        t: "p",
        c: "يعني التصفح هيكون أسرع خاصة على النت الضعيف، زي هالأيام النت وضعه صعب",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "حليت سؤال 25 - السؤال الأخير من Project Euler",
      },
      {
        t: "img",
        c: "https://i.imgur.com/FhLBL3X.jpeg",
        isLightImage: true,
      },
      {
        t: "p",
        c: "بده اياني أعرف أول رقم بسلسلة فيبوناتشي فيه 1000 رقم",
      },
      {
        t: "p",
        c: "يعني رقم عبارة عن 1 وجنبه 999 صفر!",
      },
      {
        t: "p",
        c: "هاد الكلام مستحيل ينحسب هيك بالكود، كان لازم ألاقي طريقة لحله",
      },
      {
        t: "p",
        c: "الفكرة للحل اني همشي بالسلسلة رقم رقم، هحول الرقم لنص عشان احسب طوله، لعند م أوصل لطول 1000 بوقف",
      },
      {
        t: "img",
        c: "https://i.imgur.com/dMLOdZN.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "المواضيع اللي تعملت عنها الأسبوع هاد",
      },
      {
        t: "ul",
        c: [
          {
            title: "Advanced HTML + CSS",
            link: "#",
          },
          {
            title: "Accessibility, ARIA, ARIA Attributes",
            link: "#",
          },
        ],
      },
      {
        t: "img",
        c: "https://i.imgur.com/Sn3VjvR.jpeg",
        isLightImage: true,
      },
      {
        t: "h1",
        c: "موضوع الAccessibility أو سهولة الوصول",
      },
      {
        t: "p",
        c: "موضوع مهم لأنه بيعلمك كيف تخلي الموقع متجاوب مع كل المستخدمين",
      },
      {
        t: "p",
        c: "حتى اللي عندهم احتياجات خاصة، باستخدام تقنيات مثل التباين اللوني الواضح",
      },
      {
        t: "p",
        c: "الكلام سهل القراءة، الواضح، التنقل باستخدام الكيبورد، وكمان حجات تانية",
      },
      {
        t: "h1",
        c: "بعد هيك هفوت على كورس الرياكت! 🔥",
      },
      {
        t: "hr",
      },
      {
        t: "img",
        c: "https://i.imgur.com/NrjHuUZ.jpeg",
      },
    ],
  },
  {
    id: 8,
    isSpecial: true,
    meta: {
      duration: "من 19 فبراير لـ 25 فبراير",
      summary: "خلصت كورس الجافاسكريبت",
      year: 2025,
    },
    events: [
      {
        t: "h1",
        c: "إنجاز جديد 🎉",
      },
      {
        t: "p",
        c: "أخيرا وبعد سنة ونص، وأكتر من مرة أحاول أتعلم جافاسكريبت، خلصتها 🔥🙂",
      },
      {
        t: "img",
        c: "https://i.imgur.com/0mzRSaB.png",
        isLightImage: true,
      },
      {
        t: "h1",
        c: "المشروع الأخير",
      },
      {
        t: "h2",
        c: "⚔️ Battleships ⚔️",
      },
      {
        t: "img",
        c: "https://i.imgur.com/vfLWKqB.png",
        isLightImage: true,
      },
      {
        t: "p",
        c: "شكل اللعبة هيك، الفكرة انه كل لاعب بيحط سفن بمكان مخفي عن اللاعب الثاني، وتصير تحزر وين اماكنهم عن طريق رمي قذائف بشكل عشوائي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/YVVnmyI.jpeg",
        thumbnail: "https://i.imgur.com/JsMmOXc.jpeg",
        isLightImage: true,
      },
      {
        t: "hr",
      },
      {
        t: "h2",
        c: "حليت سؤال رقم 22 من Project Euler ✅",
      },
      {
        t: "img",
        c: "https://i.imgur.com/zgKEirM.png",
        isLightImage: true,
      },
      {
        t: "h1",
        c: "المطلوب؟",
      },
      {
        t: "p",
        c: "معطيني ملف نصي فيه أكتر من 5 آلاف إسم",
      },
      {
        t: "p",
        c: "بالأول طالب إني أرتبهم أبجديا، بعدين بده اياني أحسب السكور لكل اسم",
      },
      {
        t: "p",
        c: "سكور كل اسم هو مجموع القيمة العددية لكل حرف بالإسم",
      },
      {
        t: "p",
        c: "القيمة العددية لكل حرف هي ترتيبه بالأبجدي",
      },
      {
        t: "p",
        c: "A = 1, B = 2, .... Z = 26",
      },
      {
        t: "img",
        c: "https://i.imgur.com/1jK6AQZ.png",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "برمجت رسم بتخليني أوثق قديش بتعلم بكل يوم بالأسبوع 📊",
      },
      {
        t: "p",
        c: "إذا مشي الحال، المفروض أبدأ استخدمها بالأسبوع الجاي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/fsjAtLQ.png",
      },
    ],
  },
  {
    id: 7,
    meta: {
      duration: "من 12 فبراير لـ 18 فبراير",
      summary: "مشوار غزة الثاني",
      year: 2025,
    },
    events: [
      {
        c: "مشوار غزة الثاني",
        t: "h1",
      },
      {
        t: "p",
        c: "الهدف: زيارة إيمان أختي وتفقد وضع البيت",
      },
      {
        t: "p",
        c: "بديت أوثق من الساعة 4 وعشر دقايق، شارع صلاح الدين، النصيرات",
      },
      {
        t: "img",
        c: "https://i.imgur.com/X2ZjXUu.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/m8VLAmF.jpeg",
        isLightImage: true,
      },
      {
        t: "hr",
      },
      {
        t: "p",
        c: "مشينا لعند الوادي، وهناك كانت طوابير السيارة ممتدة لعند نتساريم",
      },
      {
        t: "img",
        c: "https://i.imgur.com/sTXQdYe.jpeg",
        isLightImage: true,
      },
      {
        t: "hr",
      },
      {
        t: "p",
        c: "كملنا مشي على شارع صلاح الدين، وكان الوقت للوصول ساعتين حسب البرنامج",
      },
      {
        t: "img",
        c: "https://i.imgur.com/VC9kcA9.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "p",
        c: "بالبداية كنا متوترين، هل هنمشي شارع صلاح الدين، ولا نروح مع طريق السيارات",
      },
      {
        t: "p",
        c: "قررنا بنضل على شارع صلاح الدين، كان فاضي الشارع وعندي عالبرنامج كان مخطط بالأحمر",
      },
      {
        t: "p",
        c: "بس سألنا الناس هناك وقالو الطريق سليمة، وقتها ضلينا ماشيين صلاح الدين",
      },
      {
        t: "img",
        c: "https://i.imgur.com/HYmkDSY.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/20LxI4E.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/AD2KBFW.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/pDtNLP6.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/rdTULeW.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/fixdzRv.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/nPzLUFn.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/ZZGxpk2.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "p",
        c: "طلعنا من المنطقة الخطرة، وصلنا الزيتون",
      },
      {
        t: "img",
        c: "https://i.imgur.com/wygTMFc.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/yBPuQLr.jpeg",
        isLightImage: true,
      },
      {
        t: "hr",
      },
      {
        t: "p",
        c: "أخدنا بريك على دوار شارع رقم 10 بالزيتون",
      },
      {
        t: "img",
        c: "https://i.imgur.com/tqpdTD7.jpeg",
        isLightImage: true,
      },
      {
        t: "hr",
      },
      {
        t: "p",
        c: "بنمشي من الزيتون، للساحة، ومن هناك للجندي المجهول",
      },
      {
        t: "img",
        c: "https://i.imgur.com/pN7nxZA.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/gGq2s8b.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/3gnHvkO.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/84hpJ2F.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/4oY1dKl.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "كاظم، الساحة 🪐",
      },
      {
        t: "img",
        c: "https://i.imgur.com/mVPbp5W.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "p",
        c: "وصلنا الساعة 7، بعد صلاة العشاء، رتبنا شقة إيمان، حضرنا فيلم بالليل ونمنا",
      },
      {
        t: "p",
        c: "صحينا تاني يوم كملنا شغل بالشقة، خلصنا على صلاة العصر ورجعنا على دير البلح",
      },
      {
        t: "img",
        c: "https://i.imgur.com/YsaEeUF.jpeg",
        isLightImage: true,
      },
      {
        t: "img",
        c: "https://i.imgur.com/dSly3x0.jpeg",
        isLightImage: true,
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "لحقت حالي تعلمت اشي بالأسبوع",
      },
      {
        t: "img",
        c: "https://i.imgur.com/jQO0hM4.jpeg",
        isLightImage: true,
      },
      {
        t: "hr",
      },
      {
        t: "h3",
        c: "سويت سكريبت بيخلي تنزيل الأسابيع أسهل، هو بيكتب الكود لحاله، وأنا بس بدخل الكلام ورابط الصور ✨",
      },
      {
        t: "img",
        c: "https://i.imgur.com/AKUl3Rk.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/S4ZbZT8.png",
      },
    ],
  },
  {
    id: 6,
    meta: {
      duration: "من 5 فبراير لـ 11 فبراير",
      summary: "شغل بالبطاريات، مشروع هيكسا",
      year: 2025,
    },
    events: [
      {
        c: "كان النت فاصل بأغلب الوقت، سليت حالي بالشغل ببطاريات ليثيوم جبتهم من غزة لما رحت",
        t: "p",
      },
      {
        t: "img",
        c: "https://i.imgur.com/BH9t49n.jpeg",
        thumbnail: "https://i.imgur.com/3BkQ8Yg.jpg",
        size: "long",
      },
      {
        t: "hr",
      },
      {
        t: "p",
        c: "وفي كمان عملت مشروع بإسم هيكسا، شرحه بالصورة اللي تحت",
      },
      {
        t: "img",
        c: "https://i.imgur.com/brPZ4Iv.jpeg",
        thumbnail: "https://i.imgur.com/aw0fDZ8.jpeg",
        size: "long",
      },
    ],
  },
  {
    id: 5,
    meta: {
      summary: "حل كمان أسئلة برمجة، مشاريع عالخفيف",
      duration: "من 29 يناير لـ 4 فبراير",
      year: 2025,
    },
    events: [
      {
        t: "h1",
        c: "مشروع جديد: Linked Lists",
      },
      {
        t: "p",
        c: "لينكد ليست؟ موضوع أخذته بالجامعة وفاهمه من زمان، عشان هيك خلصته بسرعة",
      },
      {
        t: "img",
        isLightImage: true,
        c: "https://i.imgur.com/zdpT84t.png",
      },
      {
        t: "img",
        isLightImage: true,
        c: "https://i.imgur.com/XixYDKs.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/Ef9w84c.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/ka2g2Vc.png",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "خطوة جديدة: تعلمت كيف أسوي اختبارات تلقائية للكود 🛠",
      },
      {
        t: "p",
        c: "الهدف؟ كل تعديل على الكود بيخليني متطمن انه مابيخرب اشي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/W9siGTo.png",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "🤓 Progress on Project Euler",
      },
      {
        t: "p",
        c: "حليت الأسئلة 17، 18، 19، 20",
      },
    ],
  },
  {
    id: 4,
    meta: {
      summary: "تحديث جديد - إضافة زر أهداف سنوية، مشوار غزة الأول",
      year: 2025,
      duration: "من 22 يناير لـ 28 يناير",
    },
    events: [
      {
        t: "h1",
        c: "تحديث جديد على الموقع 🆕",
      },
      {
        t: "h4",
        c: " إضافة زر خاص بالأهداف لكل سنة، عشان أوثق الإنجازات وأظلني متابع التطور 🎯",
      },
      {
        t: "img",
        c: "https://i.imgur.com/tjP7X6Q.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/LqwR8zt.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/RxEEsQp.jpeg",
      },
      {
        t: "img",
        c: "https://i.imgur.com/IkzqJcg.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/t4JAx08.png",
      },
      {
        t: "h1",
        c: "تحديثات على Github الموقع",
      },
      {
        t: "p",
        c: "ربطت Github بالكود الخاص بتطوير الموقع",
      },
      {
        t: "p",
        c: "يعني صار Github مربوط بكود البناء والتطوير",
      },
      {
        t: "h1",
        c: "عملت فرعين منفصلين",
      },
      {
        t: "p",
        c: "فرع للموقع الجاهز بعد كل تحديث",
      },
      {
        t: "p",
        c: "فرغ خاص لكود التطوير",
      },
      {
        t: "h1",
        c: "الطريقة القديمة: كل مرة كنت لازم أعدل التحديثات يدويا",
      },
      {
        t: "img",
        c: "https://i.imgur.com/qnIQgph.png",
      },
      {
        t: "h1",
        c: "الطريقة الجديدة: تحديثات أسرع وأسهل، مرة واحدة وكل شيء يصير تلقائي",
      },
      {
        t: "img",
        c: "https://i.imgur.com/bDGJPVb.png",
      },
      {
        t: "p",
        c: "النتيجة؟ الكود صار يسمح لي أعمل سكريبت يحدث الموقع لحاله بعد هيك 😎",
      },
      {
        t: "img",
        c: "https://i.imgur.com/nLSJJ1e.png",
      },
      {
        t: "h1",
        c: "مشوار غزة الأول",
      },
      {
        t: "iframe",
        type: "shorts",
        videoId: "bL3z0ifa80Y",
      },
    ],
  },
  {
    id: 3,
    meta: {
      summary: "برنامج تودوليست",
      year: 2025,
      duration: "من 15 يناير لـ 21 يناير",
    },
    events: [
      {
        t: "h1",
        c: "برمجت تطبيق To-Do List",
      },
      {
        t: "h3",
        c: "التقنيات المستخدمة 📌",
      },
      {
        t: "h4",
        c: "HTML, CSS, Javascript (ES Modules), Webpack",
      },
      {
        isLightImage: true,
        t: "img",
        c: "https://i.imgur.com/tJ62dMa.png",
      },
      {
        isLightImage: true,
        t: "img",
        c: "https://i.imgur.com/w4iAX8i.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/49FbM1g.png",
      },
      {
        t: "hr",
      },
      {
        t: "p",
        c: " الشكل الحالي للمشروع: لسا بده شوية شغل وتحسينات ✍️",
      },
      {
        t: "p",
        c: "التحديثات الجاية: إضافة البرمجة عشان يشتغل كل المطلوب من المشروع 🛠",
      },
      {
        isLightImage: true,
        t: "img",
        c: "https://i.imgur.com/DpJH25o.png",
      },
      {
        isLightImage: true,
        t: "img",
        c: "https://i.imgur.com/QG2bSCf.png",
      },
      {
        t: "hr",
      },
      {
        t: "h3",
        c: "بعد يومين شغل، التصميم والبرمجة صاروا جاهزين ⏳",
      },
      {
        isLightImage: true,
        t: "img",
        c: "https://i.imgur.com/kBNLBC3.png",
      },
      {
        isLightImage: true,
        t: "img",
        c: "https://i.imgur.com/lAti3Mb.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/GOzoRfv.png",
      },
      {
        t: "img",
        c: "https://i.imgur.com/P14lZeI.png",
      },
    ],
  },
  {
    id: 2,
    isSpecial: true,
    meta: {
      summary: "برمجة هاد الموقع",
      year: 2025,
      duration: "من 8 يناير لـ 14 يناير",
    },
    events: [
      {
        t: "h1",
        c: "برمجة هاد الموقع 💻",
      },
      {
        t: "img",
        c: "https://i.imgur.com/a4QOAMo.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h2",
        c: "التصميم الأول: كان بسيط",
      },
      {
        t: "img",
        c: "https://i.imgur.com/FKy14XK.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "h2",
        c: "بعدين قررت أسرق شوية إلهام من الإنستا 🙂",
      },
      {
        t: "p",
        c: "ضفت اقتباس جديد كل أسبوع، وعملت تعديلات على التصميم بحيث يكون متجاوب أكتر",
      },
      {
        t: "hr",
      },
      {
        t: "h1",
        c: "الشكل على الجوال 📱",
      },
      {
        t: "img",
        c: "https://i.imgur.com/irrN5sh.jpeg",
        size: "small",
      },
      {
        t: "h1",
        c: "الشكل على الشاشات الأكبر",
      },
      {
        t: "img",
        c: "https://i.imgur.com/mFnu2wz.jpeg",
        size: "normal",
      },
      {
        t: "hr",
      },
      {
        t: "p",
        c: "اليوم 14 يناير: كملت 142 يوم متواصل في تعلم اللغة العبرية 🔥",
      },
      {
        isLightImage: true,
        t: "img",
        c: "https://i.imgur.com/nLRIDzc.jpeg",
        size: "small",
      },
    ],
  },
  {
    id: 1,
    meta: {
      summary: "حل أسئلة برمجة",
      year: 2025,
      duration: "من 1 يناير لـ 7 يناير",
    },
    events: [
      {
        t: "h1",
        c: "بديت بحل أسئلة موقع بروجكت أولر",
      },
      {
        isLightImage: true,
        t: "img",
        c: "https://i.imgur.com/PK0BXVx.jpeg",
      },
      {
        t: "p",
        c: "حليت 16 سؤال من أصل 25 مقرر أحلهم خلال السنة",
      },
      {
        t: "img",
        c: "https://i.imgur.com/C3OM08R.jpeg",
      },
      {
        t: "hr",
      },
      {
        t: "p",
        c: "هاد الأسئلة فكرتها تخليك تستخدم الرياضات مع البرمجة، الأهم انك تفكر بالحل الأسرع والأخف، بتخليك تحك راسك وتجيب حلول بدها تفكير طويل",
      },
      // {
      //   t: "ul",
      //   c: [
      //     {
      //       title: "Google",
      //       link: "https://www.google.com",
      //     },
      //     {
      //       title: "Google",
      //       link: "https://www.google.com",
      //     },
      //   ],
      // },
    ],
  },
];

export const latestWeek = weeks.length;
